[{"content":"Viaone Services is in search of a proven Jr. Software Developer to join our Dallas, TX Office!Job Fair: Date: May 22, 2019From: 4:00 pm to 6:00 pmWhere: 3030 LBJ Freeway Suite 1320 Dallas, Texas 75234! Preregistration Required!RSVP: 469-310-4605Core Responsibilities:In this role, you will be personally responsible for working through the full software development lifecycle (SDLC) - meet with internal clients to gather requirements, design and propose software solutions, and be personally responsible for coding, testing, release and ongoing maintenanceProven experience as a Software Developer, Software Engineer or similar roleCandidate needs to be willing to closely work with and learn the operations of other teams to better match solutions with day to day needsLearn existing software solutions, provide ongoing maintenance, and develop regular updates to enhance capabilitiesIdeally, candidate will possess a strong mastery in translating user stories and problem statements into workable solutions focusing on UX/UI components easily understood by hourly associatesCreate and maintain documentation detailing software functionality and useAbility to learn new languages and technologiesFamiliarity with Agile development methodologiesTechnical SkillsProfessional working proficiency in Java, NodeJS Framework (Meteor), SQL, and NoSQL.A familiarity with HTML, JavaScript, and CSS (or CSS Frameworks - Semantic UI, Bootstrap, Etc.)Familiar with deploying and maintaining REST Web Services (Java Jersey/Grizzly)Can read and interpret technical documents at a high levelA familiarity with cloud computing services. (From the Amazon Web Services Catalog - DynamoDB, Lambda, EC2, S3, Route53)The ability to navigate and maintain various operating systems Windows Server (2012 & 2016), Linux Server (Ubuntu), Windows, MacOSProficient in Maintaining Legacy systemsQualifications:1+ years of experienceBachelor’s Degree PreferredCombination of education and work experience will be consideredSalary:58,000 - 65,000 (Depending on Experience)Location:Dallas, Texas 75237Employer Not paying relocationNo Visa SponsorshipJob Type: Full-timeSalary: $58,000.00 to $65,000.00 /yearExperience:Windows: 1 year (Preferred)Legacy systems: 1 year (Preferred)Software Development: 1 year (Preferred)Microsoft Windows Server: 1 year (Preferred)CSS: 1 year (Preferred)Java: 1 year (Preferred)DynamoDB: 1 year (Preferred)Inventory Management: 1 year (Preferred)Back End Developer: 1 year (Preferred)Java Script: 1 year (Preferred)Front End Developer: 1 year (Preferred)Cloud Computing: 1 year (Preferred)Mac OS: 1 year (Preferred)Amazon Web Services: 1 year (Preferred)Linux: 1 year (Preferred)Education:Bachelor's (Preferred)Location:Dallas, TX 75237 (Preferred)Work authorization:United States (Required)Work Location:One location"},{"content":"So . . . what are you in for?\n\nWe don’t just make machines move, we are on a relentless pursuit to abandon the ordinary and be extraordinary. Our teams are committed to creating and producing state-of-the-art products, and they have fun doing it. Our people believe that teamwork is essential and success hinges on our commitment to unmatched customer care and reliability. Are you ready to shift into high gear and unlock your potential? Trailblazers, check out our job postings. Learn more at www.Hydro-Gear.com .\nWhat you'll do\n\nDo you enjoy pushing boundaries with creative ideas and solutions? Are you eager to collaborate and be part of a winning team? Are you driven by a passion for innovation? Then you will e njoy being responsible for the entire process of developing and testing mobile applications; work on projects with others from Marketing, Sales, Engineering, IT; b e able to determine hardware, software, and system requirements for new applications; and c ollaborate with a multi-functional engineering and software team in an environment that is development conducive.\nExperience\n\nBachelor’s degree in Computer Science/Engineering (or similar) with minimum 2 years of work related experience\nDesigning, developing, and troubleshooting in native and cross-platform environments\nSource code control, build, and release management\nXamarin cross-platform mobile application development is preferred\nInterfacing with Bluetooth peripheral devices preferred\nMVVM software architecture (or similar) is preferred\nBuild automation, distribution, beta testing, and crash reporting is preferred\nAndroid, iOs, mobile application developer, java, mobile app, mobile application, mobile developer"},{"content":"So . . . what are you in for?\n\nWe don’t just make machines move, we are on a relentless pursuit to abandon the ordinary and be extraordinary. Our teams are committed to creating and producing state-of-the-art products, and they have fun doing it. Our people believe that teamwork is essential and success hinges on our commitment to unmatched customer care and reliability. Are you ready to shift into high gear and unlock your potential? Trailblazers, check out our job postings. Learn more at www.Hydro-Gear.com .\nWhat you'll do\n\nDo you enjoy pushing boundaries with creative ideas and solutions? Are you eager to collaborate and be part of a winning team? Are you driven by a passion for innovation? Then you will e njoy being responsible for the entire process of developing and testing mobile applications; work on projects with others from Marketing, Sales, Engineering, IT; b e able to determine hardware, software, and system requirements for new applications; and c ollaborate with a multi-functional engineering and software team in an environment that is development conducive.\nExperience\n\nBachelor’s degree in Computer Science/Engineering (or similar) with minimum 2 years of work related experience\nDesigning, developing, and troubleshooting in native and cross-platform environments\nSource code control, build, and release management\nXamarin cross-platform mobile application development is preferred\nInterfacing with Bluetooth peripheral devices preferred\nMVVM software architecture (or similar) is preferred\nBuild automation, distribution, beta testing, and crash reporting is preferred\nAndroid, iOs, mobile application developer, java, mobile app, mobile application, mobile developer"},{"content":"We’re a small team of friends who build awesome software together. Expected Behavior is profitable, self-funded, and currently runs two SaaS products: Instrumental (an application monitoring platform) and DocRaptor (an HTML-to-PDF API).We’re looking for an experienced developer who thrives in a fast-paced, highly-collaborative environment.As a software developer at Expected Behavior, your responsibilities will include:Building scalable and reliable product featuresParticipating in the product vision and roadmap decision processIdentifying and resolving complex production issuesConducting design and code reviewsTesting code for robustness, including edge cases, usability, and reliabilityMaintaining current knowledge of the latest development tools and techniquesYou’ll generally work on a two or three-person team with frequent pair programming. While we love working at the office and hanging out together, we also strongly support flexible schedules and working from home (or anywhere) when convenient. Meetings will be rare, as we communicate primarily via Basecamp and chat.Most of your work will be in Ruby with some JavaScript. Our primary tech stack includes Rails, Postgres, Mongo, MySQL, Redis, React, Webpack, and many AWS products--though we also have important projects in Scala, Node, PHP, and other tools.QualificationsExperience & Education Level:3-10+ years of professional development experience; we value expertise and fit over the number of years you've workedMust Haves:Demonstrated strong written communication skillsDemonstrated experience with application development using Ruby, JavaScript, HTML, CSS, and an RDBMSDemonstrated experience with full application lifecycle including prototyping, testing, development, review, deploying, and monitoringFamiliarity with data-driven application concepts including monitoring, data warehousing, reporting, and A/B testingFamiliarity with *nix environmentsWillingness to learn new programming languagesNice to Haves:Prior SaaS or API development experienceComfortable with the full development stack, from HTML to DevOpsExperience with MongoDB and NoSQL database designSolid grasp of fundamental Computer Science conceptsExperience with high-throughput,high-availability systemsFamiliarity with Application Performance Monitoring tools (Instrumental, NewRelic, AppDynamics, etc.)Familiarity with cloud hosting providers (AWS, Google Cloud, etc.)Experience with TDD/BDDExperience with React and modern JavaScript build and testing toolsWorking at Expected BehaviorWe experiment, examine, and change both our processes and our products frequently. We love solving challenging technical problems, such as how to process over two million streaming events every second or performing zero-downtime database migrations. We prefer collaboration to ego-driven decisions and self-direction to needing frequent oversight. We try to solve problems with technology and automation.We believe the pursuit of personal happiness produces incredible work. Happiness means working on things that make us excited to get out of bed in the morning. It means working where we want. It means setting our own schedules so we can pick our kids up from school or start playing Fallout 4 as soon as we have it in-hand. We encourage quarterly vacations, at a minimum, and we frequently take a week off from our “regular work” just to explore new technologies that excite us.In addition to a highly competitive salary, everyone here receives full benefits packages including healthcare, a 401k plan with matching, a standing desk, a top-of-the-line MacBook Pro (and peripherals and accessories), and a cell phone plan with the phone of your choice.We value diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Applicants must be U.S. citizens or permanent residents. This position is located in Indianapolis, Indiana. Relocation plans are available.Job Type: Full-timeSalary: $95,000.00 to $150,000.00 /year"},{"content":"*Contingent HireMust hold an active secret clearance*Research, design, and develop computer and network software or specialized utility programs. Analyze user needs and develop software solutions, applying principles and techniques of computer science, engineering, and mathematical analysis. Update software or enhance existing software capabilities. May work with computer hardware engineers to integrate hardware and software systems, develop specifications, and performance requirements. Maintain databases within an application area, working individually or coordinating database development as part of a team.Experience: Candidate must have approximately 3 or more years of experience with software development. Requires knowledge of software engineering functions including: requirements development, configuration management, quality assurance, testing, reliability and maintainability, cost estimating, risk analysis, metrics, and human factor integration. DoD acquisition and military training experience preferable.Education: B.S. in computer engineering or computer science.Job Type: Full-timeExperience:Software Development: 5 years (Preferred)java: 1 year (Preferred)Work authorization:United States (Preferred)Work Location:One location"},{"content":"*Contingent HireMust hold an active secret clearance*Research, design, and develop computer and network software or specialized utility programs. Analyze user needs and develop software solutions, applying principles and techniques of computer science, engineering, and mathematical analysis. Update software or enhance existing software capabilities. May work with computer hardware engineers to integrate hardware and software systems, develop specifications, and performance requirements. Maintain databases within an application area, working individually or coordinating database development as part of a team.Experience: Candidate must have approximately 3 or more years of experience with software development. Requires knowledge of software engineering functions including: requirements development, configuration management, quality assurance, testing, reliability and maintainability, cost estimating, risk analysis, metrics, and human factor integration. DoD acquisition and military training experience preferable.Education: B.S. in computer engineering or computer science.Job Type: Full-timeExperience:Software Development: 5 years (Preferred)java: 1 year (Preferred)Work authorization:United States (Preferred)Work Location:One location"},{"content":"Entry-Level Software Developersare in demand across USA You'll be matched and deployed to a development team in a strategic business, based on your offered location and fit.AZ - Tuscon, PhoenixCA - Almaden, Costa Mesa, Emeryville, Foster City, San Francisco, San JoseCO - DenverGA - Atlanta, Brookhaven, Sandy SpringsIL - ChicagoMA - Cambridge, LittletonMN - RochesterNC - Raleigh-DurhamNY - New York City, North Castle/Armonk, Poughkeepsie, Yorktown Heights, EndicottOH - DublinOR - HillsboroPA - Blue Bell, PittsburghTX - Austin, Dallas, Irving, HoustonVT - Essex JunctionWI - HartlandOpportunities in these locations will vary based on business demand.What You’ll Do:You’ll work in an Agile, collaborative environment to understand requirements, design, code and test innovative applications, and support those applications for our highly valued customers.You’ll employ IBM’s Design Thinking and Agile methodologies to create products that provide a great user experience along with high performance, security, quality, and stability.You’ll work with a variety of relational databases (SQL, Postgres, DB2, MongoDB), operating systems (Linux, Windows, iOS, Android), and modern UI frameworks (Backbone.js, AngularJS, React, Ember.js, Bootstrap, Node.js, and JQuery).Who You Are:You are highly motivated and have a passion for creating and supporting great products.You thrive on collaboration, working side by side with people of all backgrounds and disciplines, and you have very strong verbal and written communication skills.You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.You have a basic understanding of software development and programming in a language .Net ,Java, Javascript, C, C++, or Python.Required Technical and Professional ExpertiseMust have basic knowledge in one of the following technology areas: .Net,Java, Javascript, C, C++, or PythonPreferred Tech and Prof ExperienceWilling to travel up to 10%Bachelors or Masters DegreeJob Types: Full-time, Part-time, Temporary, Internship, Contract, CommissionJob Types: Full-time, ContractSalary: $70,000.00 to $80,000.00 /yearExperience:java: 1 year (Preferred)Location:Los Angeles, CA (Preferred)Additional Compensation:BonusesWork Location:Multiple locationsContract Renewal:LikelyFull Time Opportunity:No"},{"content":"Entry-Level Software Developersare in demand across USA You'll be matched and deployed to a development team in a strategic business, based on your offered location and fit.AZ - Tuscon, PhoenixCA - Almaden, Costa Mesa, Emeryville, Foster City, San Francisco, San JoseCO - DenverGA - Atlanta, Brookhaven, Sandy SpringsIL - ChicagoMA - Cambridge, LittletonMN - RochesterNC - Raleigh-DurhamNY - New York City, North Castle/Armonk, Poughkeepsie, Yorktown Heights, EndicottOH - DublinOR - HillsboroPA - Blue Bell, PittsburghTX - Austin, Dallas, Irving, HoustonVT - Essex JunctionWI - HartlandOpportunities in these locations will vary based on business demand.What You’ll Do:You’ll work in an Agile, collaborative environment to understand requirements, design, code and test innovative applications, and support those applications for our highly valued customers.You’ll employ IBM’s Design Thinking and Agile methodologies to create products that provide a great user experience along with high performance, security, quality, and stability.You’ll work with a variety of relational databases (SQL, Postgres, DB2, MongoDB), operating systems (Linux, Windows, iOS, Android), and modern UI frameworks (Backbone.js, AngularJS, React, Ember.js, Bootstrap, Node.js, and JQuery).Who You Are:You are highly motivated and have a passion for creating and supporting great products.You thrive on collaboration, working side by side with people of all backgrounds and disciplines, and you have very strong verbal and written communication skills.You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.You have a basic understanding of software development and programming in a language .Net ,Java, Javascript, C, C++, or Python.Required Technical and Professional ExpertiseMust have basic knowledge in one of the following technology areas: .Net,Java, Javascript, C, C++, or PythonPreferred Tech and Prof ExperienceWilling to travel up to 10%Bachelors or Masters DegreeJob Types: Full-time, Part-time, Temporary, Internship, Contract, CommissionJob Types: Full-time, ContractSalary: $70,000.00 to $80,000.00 /yearExperience:java: 1 year (Preferred)Location:Los Angeles, CA (Preferred)Additional Compensation:BonusesWork Location:Multiple locationsContract Renewal:LikelyFull Time Opportunity:No"},{"content":"Daily ResponsibilitiesUse software tools and techniques to develop code to solve complex problems.Write code that deals with the inner workings of a technical soft floor covering production machine. There will also be coding requirements to support the operational needs of our customer’s production facilities and ancillary equipment. Which will include production reporting, raw material planning, data analytics, etc.Successful candidates will have strong logical and mathematical skills.Work as a team member and follow directions with respect to superiors and peers.Any other duties including field work as assigned by the supervisor or managers.Job Qualifications: BS Computer Science (or similar) or equivalent experience.Above average logical, analytical, verbal, written, and mathematical skillsPreferred experience with:C#Java.NET FrameworkWindows FormsAdditional experience with the following would be a plus:Windows Presentation FoundationMicrosoft Reporting [Crystal Reports, Access Reports]Regular ExpressionsXMLSQLNecessary skills: Critical thinking – use logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions, or approaches to problems· Attention to Detail —Must be detail oriented and thorough· Dependability — Must be reliable, responsible, and dependable· Cooperation — Must display a cooperative attitude and work well within a team.· Innovation — Job requires creativity and alternative thinking to develop new ideas.· Integrity — Must be honest and ethical in all situations.· Initiative — Must be willing to take on responsibilities and challenges.Job Type: Full-timeExperience:.NET: 1 year (Preferred)C#: 1 year (Preferred)"},{"content":"Daily ResponsibilitiesUse software tools and techniques to develop code to solve complex problems.Write code that deals with the inner workings of a technical soft floor covering production machine. There will also be coding requirements to support the operational needs of our customer’s production facilities and ancillary equipment. Which will include production reporting, raw material planning, data analytics, etc.Successful candidates will have strong logical and mathematical skills.Work as a team member and follow directions with respect to superiors and peers.Any other duties including field work as assigned by the supervisor or managers.Job Qualifications: BS Computer Science (or similar) or equivalent experience.Above average logical, analytical, verbal, written, and mathematical skillsPreferred experience with:C#Java.NET FrameworkWindows FormsAdditional experience with the following would be a plus:Windows Presentation FoundationMicrosoft Reporting [Crystal Reports, Access Reports]Regular ExpressionsXMLSQLNecessary skills: Critical thinking – use logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions, or approaches to problems· Attention to Detail —Must be detail oriented and thorough· Dependability — Must be reliable, responsible, and dependable· Cooperation — Must display a cooperative attitude and work well within a team.· Innovation — Job requires creativity and alternative thinking to develop new ideas.· Integrity — Must be honest and ethical in all situations.· Initiative — Must be willing to take on responsibilities and challenges.Job Type: Full-timeExperience:.NET: 1 year (Preferred)C#: 1 year (Preferred)"},{"content":"About the company\nOffchain Labs, Inc. is a New Jersey based startup, building the Arbitrum platform to unlock the full potential of smart contracts, making them private, cheap, and easy for developers. Our working prototype of Arbitrum runs on top of Ethereum, and interoperates with native Ethereum contracts and tokens.\n\nWe prefer candidates to work in the New York/New Jersey area, but we are open to remote work arrangements as well. For more information visit our website at https://offchainlabs.com.\n\nAbout the job\nWe’re looking for developers enthusiastic about programming and blockchains. In this position you’ll be on the frontline of bringing cutting-edge research to the real world and building a platform for the next generation of cryptocurrency applications. You’ll be part of a small, but growing team of developers devoted to building out the infrastructure to make Arbitrum a reality.\n\nOur ideal candidate is a strong developer with the desire to learn and join a revolutionary team building the next generation of blockchain technology. Don’t have prior experience in blockchain engineering? That’s okay!\n\nRequirements\nCommunicates effectively and works well in a team setting\nBS degree in computer science or related technical field or equivalent technical experience\nWe’re particularly interested in developers with experience in one or more of the following areas:\n\nCompilers and Architecture\nSDK Development\nSecurity Engineering\nSalary and Benefits\nWe offer a highly competitive salary and benefits package, plus an employee equity incentive program. We are looking for both junior and senior people, and compensation will be commensurate with experience.\n\nWe strive to create a friendly workplace that is welcoming to all people.\n\nTo apply, please send your resume to jobs@offchainlabs.com."},{"content":"About DataQuest corp: Dataquest Corp is an IT services company based in NJ offering a wide array of solutions customized for a range of key verticals and horizontal industries across USA. We consult with our clients to build effective organizations, innovate & grow, reduce costs, manage risk & regulation and leverage talent. We are an E-Verified company.We have a dedicated development team with amazing range of skills, deep vertical industries expertise and excellence in advanced technologies. By wise blend of business analysis & management with latest technology, Dataquest Corp designs and develops custom made software & web applications. We have a broad range of technology services that deliver real business results. Our main preference is to gain your trust through our commitment and integrity, extending maximum value to you and striving to exceed your expectations.Job Responsibilities: Design, Coding, testing, offshore coordination, coordinate with POMandatory Skills:Java, Spring, Spring boot, React JS, HTML5, JavaScript, Knockout JSDesired Skills:Agile and Healthcare experience will be a plus.Qualifications: BS/MS in Computer Science, Computer Engineering, MIS, or Similar FieldBasic Working Knowledge of Data Bases such as SQL, PLSQL (Preferred)Basic Working Knowledge of C, C++ (Preferred)Strong Communication SkillsFamiliarity with Software Development Lifecycle (a definite plus, but not required)Interested candidates can reach me on (732)731-0281 for immediate responseJob Types: Full-time, Part-time, Temporary, Internship, Contract, CommissionSalary: $60,000.00 to $80,000.00 /yearExperience:java: 1 year (Required)Education:Master's (Preferred)Commission Only:No"},{"content":"About Us\n\nEstablished in 1981, SURVICE Engineering is a nationally recognized, single-source engineering service provider for Government and Industry organizations involved in all phases of the systems engineering process. We're proud to support the development, testing, and analysis of many of the major U.S. combat systems in the field today.\n\nPosition Summary\n\nSURVICE Engineering seeks an Entry-Junior Level Software Developer/Programmer Analyst to support our PMC operation in Albuquerque, NM or Socorro, NM. The Software Developer will be responsible for analysis, design, development, documentation, and maintenance of software supporting a wide variety of scientific and engineering applications. The ideal candidate will have excellent communication skills, a desire to learn and to apply new skills, and the ability to collaborate and innovate productively in both team and solo software development settings.\n\nPrimary Duties & Responsibilities\n\nCollaborates with other software developers to analyze, estimate, design, and implement features\nParticipates in planning meetings and technical coordination meetings for reporting issues, planning, and providing status\nWorks with subject matter experts and project managers in analyzing new functional requirements while providing feasibility assessments and level of effort\nFollows the team's software development process and procedures\nWhen directed, peer review fellow software developer's code and documentation to ensure it meets team's quality standards and best practices\nWorks with software architectural owners to ensure all development meets architectural vision and system designs\nWorks with lead software engineer and senior developers in deriving technical requirements from functional requirements\nContributes to technical design documentation and maintenance of the software\nQualifications\n\nBachelor's degree in computer science, information technology or related field. Alternatively, a Bachelor's degree in Physics, Mathematics, or an Engineering discipline with a strong background of software development.\n\nProficiency in C++. Additional experience in other languages such as C, FORTRAN, and Python is desirable\nExperience in working on a software development team\nSolid coding practices including design, unit testing, and revision control\nSecurity Clearance Requirement\n\nMust be able to obtain a DoD security clearance. US citizenship is required\n\nSURVICE Engineering is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. VEVRAA Federal Contractor."},{"content":"Jr. Software Developer - Triple Crown Sports40 hours per week on site.Responsibilities: Develop and maintain websites and web-based software using ASP.NET, MVC and C#Further develop our in-house E-commerce and tournament management applicationsOngoing improvement of internal tools and systems to support our businessRequired Skills: .NET, C#, MVC/RazorVisual Studio (2015+)CSS, Bootstrap, JavaScript, and jQueryStrong SQL skills (MS SQL Server 2012+)GIT SourceBasics: Must demonstrate exceptional communication skills by conveying necessary information accurately, listening effectively, and asking questions where clarification is needed.Must be able to work independently, prioritize work activities and use time efficiently.Demonstrates accuracy and thoroughness. Looks for ways to improve and promote quality and monitors own work to ensure quality is met.Must be able to maintain confidentiality.Must possess the ability to manage and direct change, delays, or unexpected events appropriately.Must be able to stay focused and concentrate under normal or heavy distractions.Must be able to work well under pressure or stressful conditions and meet required project deadlines.Job Type: Full-timeSalary: $50,000.00 /yearEducation:Bachelor's (Required)Location:Fort Collins, CO (Required)Work authorization:United States (Required)Work Location:One location"},{"content":"We are seeking a high-energy, self-starting front end web developer to build and maintain our next generation of core products. The candidate should be well-versed with the latest trends in web-based user interfaces, as well as the tooling/development required to transform the concepts and ideas to functional software. You must possess a strong technical knowledge of systems analysis and programing and will assume responsibility for assigned projects. Responsibilities include but are not limited to implementation, testing, reporting, documentation, deployment and debug operations. Possession of creative/artistic abilities to arrive at compelling user experiences is a huge plus.\n\nResponsibilities:\nDesign, develop and support web front-ends for trading and risk management applications.\nWork with business analysts to understand and refine requirements.\nAnalyze & integrate new web products and technologies.\nWork with the QA/DevOps team to ensure a quality product and timely delivery.\n\nRequired Qualifications and Skills:\nUndergraduate degree or higher in Computer Science.\n5+ years of industry experience as a Web application developer.\nFamiliarity with Mobile first/Responsive Web Design/Information Architecture/Flexible Grid/Typography concepts.\nStrong grounding in UI design patterns and practices (e.g., MVC, MVP, PM, MVVM, Flux, Redux, Elm, MVI, SAM)\nA deep understanding of JavaScript, including ES6 and ES7.\nStrong in HTML5, CSS3, JQuery (AJAX), comfortable using npm ecosystem.\nDeep experience with at least one of Angular OR React with Redux OR Vue frameworks.\nExperience with UI component frameworks like Bootstrap 4/Bokeh/D3.js/Material.io\n3+ years of Node.js experience.\nExperience using or authoring REST services.\nDesign collaboration and prototyping tools (e.g., InVision, Sketch, Balsamiq, etc).\nPassion and sensibility for industry disrupting, best-in-class user experiences. Eye for detail, backed by diligence and patience to get things right .\nSelf-motivated with ability to function and deliver both independently and under direction.\nExperience learning and implementing third-party APIs and SDKs. For example, OAuth.\nFunctional knowledge of software version management/CI/CD. (e.g, Git/SVN, Ant/Maven, Jenkins/Hudson/Teamcity).\nInterest in Finance and Capital Markets.\n\nNice to have:\nExperience with Next.js.\nExperience with C#/ASP.Net.\nFamiliarity with Python 2.x or 3.x\nExposure to working with cloud technologies.\nFamiliarity with at least one data visualization framework (e.g., Tableau, Looker, Qlik, Power BI).\nAuthorship of mobile application either for iOS or Android platform.\nExperience with SAFe/Agile methodology.\nExperience with TDD/Web UI Testing frameworks (e.g., Enzyme/Mocha/Chai/Jasmine/Karma).\nExperience with relevant static code analysis/linting tools (e.g., ESLint).\nExperience with UI automation frameworks (e.g., Grunt/Gulp/npx).\nAuthor of (or significant contributor to) a popular open source project.\nOnline presence in the form of GitHub account or at least a StackOverflow account with significant reputation score.\nPortfolio of past projects, especially if they pertain to capital markets."},{"content":"Entry-Level Software Developersare in demand across USA You'll be matched and deployed to a development team in a strategic business, based on your offered location and fit.AZ - Tuscon, PhoenixCA - Almaden, Costa Mesa, Emeryville, Foster City, San Francisco, San JoseCO - DenverGA - Atlanta, Brookhaven, Sandy SpringsIL - ChicagoMA - Cambridge, LittletonMN - RochesterNC - Raleigh-DurhamNY - New York City, North Castle/Armonk, Poughkeepsie, Yorktown Heights, EndicottOH - DublinOR - HillsboroPA - Blue Bell, PittsburghTX - Austin, Dallas, Irving, HoustonVT - Essex JunctionWI - HartlandOpportunities in these locations will vary based on business demand.What You’ll Do:You’ll work in an Agile, collaborative environment to understand requirements, design, code and test innovative applications, and support those applications for our highly valued customers.You’ll employ IBM’s Design Thinking and Agile methodologies to create products that provide a great user experience along with high performance, security, quality, and stability.You’ll work with a variety of relational databases (SQL, Postgres, DB2, MongoDB), operating systems (Linux, Windows, iOS, Android), and modern UI frameworks (Backbone.js, AngularJS, React, Ember.js, Bootstrap, Node.js, and JQuery).Who You Are:You are highly motivated and have a passion for creating and supporting great products.You thrive on collaboration, working side by side with people of all backgrounds and disciplines, and you have very strong verbal and written communication skills.You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.You have a basic understanding of software development and programming in a language .Net ,Java, Javascript, C, C++, or Python.Required Technical and Professional ExpertiseMust have basic knowledge in one of the following technology areas: .Net,Java, Javascript, C, C++, or PythonPreferred Tech and Prof ExperienceWilling to travel up to 10%Bachelors or Masters DegreeIf any one are interested please share your resume today and call me at 732-731-0281Job Types: Full-time, Part-time, Temporary, Internship, Contract, CommissionSalary: $60,000.00 to $80,000.00 /yearExperience:.NET: 1 year (Preferred)Windows: 1 year (Preferred)DB2: 1 year (Preferred)iOS: 1 year (Preferred)C/C++: 1 year (Preferred)"},{"content":"Visual Lease is looking for a top-notch, software developer to join our engineering organization. Our development team works closely with our industry experts to design and build powerful, yet easy to use web-based SaaS platform.\n\nBeing part of a fast-growing technology team means having a lot of opportunities to learn. You will be directly contributing to the success of the team and the company in a highly visible way. As a member of the team, you will be working with talented developers to develop cutting edge applications using the latest in web development and database technologies and the Microsoft stack.\n\nWhat You Will Do\nParticipate in the software development process through the entire system life-cycle, including:\n\nDevelop new features or improving the existing features in the platform.\nProvide on going engineering support to the business by trouble shooting reported problems.\nWrite unit test cases.\nDevelop technical documentation about the developed functionality.\nWork closely with development, architecture, product management and quality assurance colleagues to build the expected functionality with quality.\nFollow engineering standards and best practices.\nWhat You Will Need\n\nTECHNICAL REQUIREMENTS:\nASP.Net / ASP.Net MVC, C#, HTML, JavaScript, CSS and jQuery\nKnowledge of Angular is nice to have\nMS SQL Server knowledge including T-SQL\n\nEDUCATION AND REQUIREMENTS:\nIdeally Bachelor degree in Computer Science or related field with good GPA.\nWe will consider good candidate with Associate or Vocational diplomas with good portfolio of work. For example, internships with technology company with SaaS products.\nFresh college graduate or 1+ years of work experience\nExcellent understanding of OO concepts.\nGood understanding of data structure and algorithms.\nGood understanding of SQL and DB queries.\nWhy Work at Visual Lease\nWe work hard, so we take care of each other and try to enjoy ourselves along the way:\n\nWe hire smart people.\nWe encourage our team to raise their hand when they see opportunity to change our existing processes\nWe value culture and believe our business thrives in the diversity of our teams.\nWe offer company paid medical benefits that are designed to support our employees.\nWe offer competitive salaries and a generous 401(k) employee matching program.\nWe are a startup with a proven business model that's growing fast- really fast!\nWe have Casual dress code (jeans are welcome).\nWe have an amazing PTO Policy that allows you to rejuvenate throughout the year and take care of yourself and your family.\nWe are passionate about our clients and live/breathe the client experience.\nWe encourage creativity and embrace change.\nWe believe in autonomy & taking initiative.\nWe collaborate with our leadership team on a daily basis to ensure vision alignment and transparency as an organization.\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."},{"content":"Overview\nNewWave is an information technology company helping businesses and government agencies modernize and thrive by applying the power of technology. NewWave began making a mark in the federal healthcare space in 2004, where we continue to actively modernize systems to improve healthcare’s value for millions of Americans. Since then, our work has expanded across various sectors and industries, where we help our customers stay ahead of the new and make the world in which we live, better.\n\nResponsibilities\nAs a Front-End Developer at NewWave, you will be a developer on a variety of client projects. You will be a member of a product scrum team in this role. You will analyze requirements and propose solutions, designs, and interactions that deliver the value of the product and its features. You will also participate in code reviews, research, and prototyping to drive the Front-End goals as necessary.\n\nWork closely within a cross-functional team of designers, product managers, and analysts to develop high-quality technical solutions to customer and business problems\nDevelop new and existing software systems to the highest technical, quality, and accountability standards, all while considering secondary concerns like security, performance, maintainability, adaptability, and simplicity\nUse and promote successful software management and technical workflow practices that shorten feedback loops between the Engineering team and others\nAdvocate for user experience and empathetic design\nDiscover ways to validate and measure the impact your work has on customers\nQualifications\n4 or more years of experience building complex consumer-facing front-end applications\n3+ years experience using one or more modern client-side frameworks (e.g., React, Vue, Angular, Ember) in a professional setting\nBacked by a wealth of experience to draw from when building and deploying performance web applications at scale\nPassionate about what makes a great user experience and knowledgeable about the technical specifics it takes to build one\nA clear, friendly, and open-minded communicator\nEager to be involved in all stages of the product development lifecycle, from concept through deployment\nSuccessful in an agile work environment, breaking down large pieces of work to deliver value incrementally\nExperience mentoring other engineers\nExperience in A/B testing and personalization\nResidency Requirement\n\nMust have lived in the United States at least 3 out of 5 years.\nFLSA Status\n\nExempt\n\nInterpersonal Skills\n\nExcellent interpersonal, verbal and written communication, and organizational skills - must be able to communicate fluently in English both verbally and in writing\nShould be extremely facts and data oriented.\nShould be deadline and closure oriented.\nStrong persuasion, facilitation and influencing skills.\nShould be self-driven.\nStrong analytical, organizational and project management skills.\nDemonstrated ability to lead and work with cross functional teams including senior level individuals.\nMust be able to thrive in a fast-paced, rapidly evolving environment with varying priorities, based on a team building culture.\nNewWave is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. NewWave is a proud Veteran friendly employer."},{"content":"Overview\nNewWave is an information technology company helping businesses and government agencies modernize and thrive by applying the power of technology. NewWave began making a mark in the federal healthcare space in 2004, where we continue to actively modernize systems to improve healthcare’s value for millions of Americans. Since then, our work has expanded across various sectors and industries, where we help our customers stay ahead of the new and make the world in which we live, better.\n\nResponsibilities\nAs a Front-End Developer at NewWave, you will be a developer on a variety of client projects. You will be a member of a product scrum team in this role. You will analyze requirements and propose solutions, designs, and interactions that deliver the value of the product and its features. You will also participate in code reviews, research, and prototyping to drive the Front-End goals as necessary.\n\nWork closely within a cross-functional team of designers, product managers, and analysts to develop high-quality technical solutions to customer and business problems\nDevelop new and existing software systems to the highest technical, quality, and accountability standards, all while considering secondary concerns like security, performance, maintainability, adaptability, and simplicity\nUse and promote successful software management and technical workflow practices that shorten feedback loops between the Engineering team and others\nAdvocate for user experience and empathetic design\nDiscover ways to validate and measure the impact your work has on customers\nQualifications\n4 or more years of experience building complex consumer-facing front-end applications\n3+ years experience using one or more modern client-side frameworks (e.g., React, Vue, Angular, Ember) in a professional setting\nBacked by a wealth of experience to draw from when building and deploying performance web applications at scale\nPassionate about what makes a great user experience and knowledgeable about the technical specifics it takes to build one\nA clear, friendly, and open-minded communicator\nEager to be involved in all stages of the product development lifecycle, from concept through deployment\nSuccessful in an agile work environment, breaking down large pieces of work to deliver value incrementally\nExperience mentoring other engineers\nExperience in A/B testing and personalization\nResidency Requirement\n\nMust have lived in the United States at least 3 out of 5 years.\nFLSA Status\n\nExempt\n\nInterpersonal Skills\n\nExcellent interpersonal, verbal and written communication, and organizational skills - must be able to communicate fluently in English both verbally and in writing\nShould be extremely facts and data oriented.\nShould be deadline and closure oriented.\nStrong persuasion, facilitation and influencing skills.\nShould be self-driven.\nStrong analytical, organizational and project management skills.\nDemonstrated ability to lead and work with cross functional teams including senior level individuals.\nMust be able to thrive in a fast-paced, rapidly evolving environment with varying priorities, based on a team building culture.\nNewWave is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. NewWave is a proud Veteran friendly employer."},{"content":"Would you like to develop software that is used by most OEM manufacturers? HBM Prenscia is currently seeking qualified applicants an on-site SOFTWARE ENGINEER.\n\nAs a Software Engineer, you will aid in the development of HBM Prenscia’s growing desktop applications which are part of an enterprise-capable, integrated reliability solution. The applications facilitate collaboration and the sharing of reliability knowledge within our customers’ organizations using applications that include life data analysis, accelerated life testing, failure mode effects analysis (FMEA) and system analysis. This position will be based in Tucson, AZ.\n\nRESPONSIBILITIES:\nDesign and develop software applications.\nDevelop layouts and documentation to identify requirements and solutions.\nWrite well-crafted, testable code.\nReview and debug code.\nPerform code reviews.\nProduct specifications and determine feasibility.\nDocument and maintain software functionality.\nIntegrate software components into a fully functional software system.\nDevelop and document software testing plans.\nComply with project plans and company standards.\nAid customer support representatives in answering technical support questions.\n\nQUALIFICATIONS:\nBachelor’s degree in Computer Science, or equivalent industry experience.\nFluency in .NET (VB.NET and/or C#).\nStrong database experience with Microsoft SQL Server and Oracle.\nDemonstrated problem-solving ability and an attention to detail.\nExcellent communication skills.\nTechnical competency, an ability to learn quickly and initiative are required.\nAbility to work well independently and in a team environment.\nExperience in Agile/Scrum development is beneficial, but not required.\nStrong mathematical background is helpful, but not required.\nKnowledge of Team Foundation Server (TFS) is useful.\nFace to Face collaboration is key to what we do, telecommuting is not available in this role"},{"content":"Overview\nZebra Technologies (Zebra.com, NASDAQ:ZBRA) builds tracking technology and solutions that generate actionable information and insight, giving companies unprecedented visibility into their businesses by giving physical things a digital voice. Globally Managed Support Services (GMSS) is an exciting part of the Zebra Technologies business, created to deliver innovative service offerings that increase the productivity and efficiencies of businesses and public organizations across key vertical markets. The Service Technologies team within GMSS is looking for an experienced Senior BigData ETL Developer to develop new products, enhance and support existing products.\n\nResponsibilities\nThe Developer will be part of a Product Engineering team developing and supporting a customer and partner facing cloud based, SaaS product. This platform gives our customers, partners, and professional services teams valuable insights to increase productivity, efficiency, and ROI. Using some of the latest technologies like Big Data, IoT, Predictive Analytics, Machine Learning and modern data collection mechanisms. Our platform gathers operational and support information for analysis and provides consolidated and actionable information to help our customers and partners manage their devices and operations in the field. In this position, the developer will be hands on developing, testing, deploying along with other developers, QA, PM, architects etc. to build new and maintain innovative data solutions and ETL.\n\nKey responsibilities include implementing Data extraction, parsing and massaging of large disparate data sets using multiple platforms and technologies to enable complex aggregations, data analytics and visualization. This person must be able to design robust and efficient ETL workflows in a cloud environment like AWS and GCP etc. Must have the experience and focus on the quality of output, best practices adherence, code coverage, good estimates etc.\n\nQualifications\nBachelors degree and 8+ years of overall software/engineering experience or Masters degree and 5+ years of overall software/engineering experience\n\n4+ years of experience developing ETL workflows in BigData environments\n3+ years of hands on experience with Scala, Java, spark and related technologies\n2+ years of experience in AWS Cloud/GCP building ETL solutions, POCs\nStrong experience with full SDLC – Requirements, Design, Development, Testing and Deployment using Agile methodologies\nMust have experience converting the concepts in to algorithms for complex business problems\nAdvanced level of knowledge in SQL\nMust have an affinity to work with data and solve data related problems\nExperience of Agile/Scrum\nMust have the experience working closely with distributed teams especially with teams in the India and EU\nExperience of having worked with other software product firms, particularly in the platforms or cloud infrastructure space will be a plus\nMust be a team player with excellent coordination skills\nMust have very good communication skills, both oral and written"},{"content":"Overview\nZebra Technologies (Zebra.com, NASDAQ:ZBRA) builds tracking technology and solutions that generate actionable information and insight, giving companies unprecedented visibility into their businesses by giving physical things a digital voice. Globally Managed Support Services (GMSS) is an exciting part of the Zebra Technologies business, created to deliver innovative service offerings that increase the productivity and efficiencies of businesses and public organizations across key vertical markets. The Service Technologies team within GMSS is looking for an experienced Senior BigData ETL Developer to develop new products, enhance and support existing products.\n\nResponsibilities\nThe Developer will be part of a Product Engineering team developing and supporting a customer and partner facing cloud based, SaaS product. This platform gives our customers, partners, and professional services teams valuable insights to increase productivity, efficiency, and ROI. Using some of the latest technologies like Big Data, IoT, Predictive Analytics, Machine Learning and modern data collection mechanisms. Our platform gathers operational and support information for analysis and provides consolidated and actionable information to help our customers and partners manage their devices and operations in the field. In this position, the developer will be hands on developing, testing, deploying along with other developers, QA, PM, architects etc. to build new and maintain innovative data solutions and ETL.\n\nKey responsibilities include implementing Data extraction, parsing and massaging of large disparate data sets using multiple platforms and technologies to enable complex aggregations, data analytics and visualization. This person must be able to design robust and efficient ETL workflows in a cloud environment like AWS and GCP etc. Must have the experience and focus on the quality of output, best practices adherence, code coverage, good estimates etc.\n\nQualifications\nBachelors degree and 8+ years of overall software/engineering experience or Masters degree and 5+ years of overall software/engineering experience\n\n4+ years of experience developing ETL workflows in BigData environments\n3+ years of hands on experience with Scala, Java, spark and related technologies\n2+ years of experience in AWS Cloud/GCP building ETL solutions, POCs\nStrong experience with full SDLC – Requirements, Design, Development, Testing and Deployment using Agile methodologies\nMust have experience converting the concepts in to algorithms for complex business problems\nAdvanced level of knowledge in SQL\nMust have an affinity to work with data and solve data related problems\nExperience of Agile/Scrum\nMust have the experience working closely with distributed teams especially with teams in the India and EU\nExperience of having worked with other software product firms, particularly in the platforms or cloud infrastructure space will be a plus\nMust be a team player with excellent coordination skills\nMust have very good communication skills, both oral and written"},{"content":"This is a permanent, full-time position.\n\nPOSITION SUMMARY\n\nWork in an agile team environment writing, modifying and debugging web based software. Tackle larger projects with the team as well as smaller defects and minor enhancements solo within a set of mature ASP.NET/C# web applications. Create and maintain documentation for teammates as well a vibrant customer development community. Participate in code review and internal auditing designed to both grow your knowledgebase and skills as a developer and share your talents with the team.\n\nESSENTIAL TASKS\n\nWork closely and effectively with your team, management and designers to build world class software applications.\nTranslate design specifications and functional requirements to web applications that work well across multiple devices for all users.\nStay current on the latest web tools, client side technologies, standards, and practices.\nWork with Quality Assurance in real time to ensure delivery of high quality software.\nCommand a strong understanding of SQL and relational databases and work with DBAs to design and maintain data structure and movement.\nCollaborate with other developers on the team as well as outside of the team to complete company priorities.\nAbility and desire to both estimate tasks and meet deadlines, working effectively with minimal supervision in a team environment.\nWork as needed with the support team to help resolve difficult technical issues in our customer base.\n\nAdditional Tasks\n\nRecommend improvements to existing software programs as necessary\nConceive, experiment with, and present architectural approaches for software applications, including web, server, and others.\nWork closely with product management to build and maintain the product backlog.\nDevelop technical specifications/requirements or prototypes, as needed, as well as document best practice or development standards for product development.\nEvaluate existing and emerging technologies and their potential to enhance the performance and robustness of a technical architecture.\nDocument standards, processes and coding practices.\nFlexible and willing to accept a change in priorities as necessary.\n\nPreferred Skills and Experience\n\nSignificant experience with these tools/technologies: C#, ASP.Net, CSS3, JavaScript/jQuery, nHibernate or similar ORM, SQL and relational databases and web development in general.\nDevelopment on web application that utilized Responsive Web Design techniques highly preferred.\nKnowledge of and experience with building WCAG 2.0/2.1 compliant applications strongly preferred.\nWell versed in SQL and relational databases. Experience with Microsoft SQL Server.\nTwitter Bootstrap CSS Framework, knowledge of Agile/iterative development processes and higher education experience are all pluses.\nBenefits\n\nMedical Insurance, Life Insurance, Dental Insurance, Vision Insurance, Paid Vacation, Paid Sick Days, Paid Holidays, Short Term Disability, Long Term Disability, 401K/403b Plan, Educational Assistance"},{"content":"This is a permanent, full-time position.\n\nPOSITION SUMMARY\n\nWork in an agile team environment writing, modifying and debugging web based software. Tackle larger projects with the team as well as smaller defects and minor enhancements solo within a set of mature ASP.NET/C# web applications. Create and maintain documentation for teammates as well a vibrant customer development community. Participate in code review and internal auditing designed to both grow your knowledgebase and skills as a developer and share your talents with the team.\n\nESSENTIAL TASKS\n\nWork closely and effectively with your team, management and designers to build world class software applications.\nTranslate design specifications and functional requirements to web applications that work well across multiple devices for all users.\nStay current on the latest web tools, client side technologies, standards, and practices.\nWork with Quality Assurance in real time to ensure delivery of high quality software.\nCommand a strong understanding of SQL and relational databases and work with DBAs to design and maintain data structure and movement.\nCollaborate with other developers on the team as well as outside of the team to complete company priorities.\nAbility and desire to both estimate tasks and meet deadlines, working effectively with minimal supervision in a team environment.\nWork as needed with the support team to help resolve difficult technical issues in our customer base.\n\nAdditional Tasks\n\nRecommend improvements to existing software programs as necessary\nConceive, experiment with, and present architectural approaches for software applications, including web, server, and others.\nWork closely with product management to build and maintain the product backlog.\nDevelop technical specifications/requirements or prototypes, as needed, as well as document best practice or development standards for product development.\nEvaluate existing and emerging technologies and their potential to enhance the performance and robustness of a technical architecture.\nDocument standards, processes and coding practices.\nFlexible and willing to accept a change in priorities as necessary.\n\nPreferred Skills and Experience\n\nSignificant experience with these tools/technologies: C#, ASP.Net, CSS3, JavaScript/jQuery, nHibernate or similar ORM, SQL and relational databases and web development in general.\nDevelopment on web application that utilized Responsive Web Design techniques highly preferred.\nKnowledge of and experience with building WCAG 2.0/2.1 compliant applications strongly preferred.\nWell versed in SQL and relational databases. Experience with Microsoft SQL Server.\nTwitter Bootstrap CSS Framework, knowledge of Agile/iterative development processes and higher education experience are all pluses.\nBenefits\n\nMedical Insurance, Life Insurance, Dental Insurance, Vision Insurance, Paid Vacation, Paid Sick Days, Paid Holidays, Short Term Disability, Long Term Disability, 401K/403b Plan, Educational Assistance"},{"content":"Job Description Summary: Bird’s eye view of your role – We are looking for an innovative, client-focused, experienced full stack Software Developer to create and maintain cutting edge software product for investment professionals that will enable them to transform the precision and efficiency of their back office operations. Excellent candidates will be collaborative, continually improving and work well in a rapidly growing, vibrant workplace. Your role will be to collaborate with your team to drive solving complex application and software problems.Job Description: What will you bring - You are a team player with minimal supervision, work cross-functionally and closely with engineering, product management, and quality assurance peers to develop innovative technical tools and solutions. You continually seek to improve the code and efficiency of our systems. This is an opportunity you do not want to miss! Great team, great company, and a great place to learn and grow.What competencies will you have –Commitment to quality, team success, superb technical skills, responsiveness and a sense of humor!Your key responsibilities will be –Create solutions for new product features and enhancements. Own feature areas and deliverables. Work effectively with management and team members to clarify needs and plan delivery of major product changes, future version and new products. Collaborate cross functionally to provide responsive support to escalated customer issues, plan delivery of product changes and new products. Ensure adequate testing of all product releases. Continually grow skills to enhance your technical expertise. Participate in code reviews.You will have – BA/BS degree in Computer Science or equivalent5+ years of experience as a Software EngineerExtensive experience with the .NET platform and .NET frameworkClient/Server fundamentals and Browser/Server interaction using IISIn-depth knowledge of C#, HTML, XML, CSS, JavaScript, JQueryIn-depth knowledge of TSQL: stored procedures, understanding of general database structureBroad experience in troubleshootingAbility to work as part of a team with minimal supervision in a results-oriented, fast-paced dynamic environmentExcellent analytical and problem solving skillsWe would love for you to have – Professional experience in the financial services industry.Master degree in relevant major.How will your lofty goals be translated into specific actions / short term goals - Within first 30 days, you will quickly get familiarized with architecture, systems and current process and tools By the end of the first quarter, you should be able to contribute to the successful delivery of a featureWhat’s in it for you? (EVP – Employee Value Proposition) - Learn, explore and contribute towards technologies, organization and self-growth by working with technology experts and architects within the organizationParticipate, grow and influence design and feature delivery on various products across the organizationWork on new technologiesBe a member of a leading fintech company, innovators in personal finance management and aggregation space and products innovation companyEarn a competitive compensation package with unique benefits and facilitiesMeet Envestnet|Tamarac Tamarac a division of Envestnet, Inc. (NYSE: ENV), is a leading independent provider of technology-enabled investment and practice management solutions for independent financial advisors, as well as small and mid-sized financial advisory firms and larger financial institutions.Tamarac serves over 800 RIA firms, collectively managing more than $500 billion in assets. Investment Advisors that use Tamarac's solution range in size from managing less than $10 million in assets to over $10 billion. Tamarac was founded in 2000 and is headquartered in Seattle, WA.Envestnet|Tamarac is an Equal Opportunity EmployerJob Type: Full-time"},{"content":"Banquest Payment Systems is a growing financial technology company that is looking for suitable candidates for a Javascript/Node.js Developer for our smart and user-friendly payment platform. Our API first payment gateway streamlines the ease of integration with our software partners. We pride ourselves on the human element approach that helps build lasting relationships.Job Summary & Core CompetenciesWe’re looking for a JavaScript/Node.js Developer who displays a positive attitude and aligns strongly with our core values: be agile, be a team player, be accountable, have high attention to detail, and be a hard & smart worker.Minimum QualificationsBachelor's Degree in computer science, information technology, or related discipline. Equivalent relevant experience will be considered in lieu of degree3+ years Node.js experience3+ years JavaScript experienceBasic understanding of REST API & experience consuming APIsFamiliarity with GIT and tools such as JIRATeam player and thrives in a small team environmentExcellent interpersonal skills; strong desire to move projects forward and be proactiveRole ResponsibilitiesYou will be part of the team responsible for maintaining the code for our Node microservices which includes bug resolution, enhancements, and new features. This role has the potential for promotion into a Lead for the right candidate.This role does not offer relocation or visa sponsorship. Candidates located in Ocean County, NJ only, please.Working at Banquest Payment SystemsOur work environment is both professional and casual. We’re serious about delivering the best product and service to our customers, but we also make it a priority to keep a fun and energetic atmosphere with a fast-paced and agile environment. We are rapidly growing and customer driven so priorities shift, and we need someone who is able to roll with changes.Casual dress code and work environment, great company culture, Party Fridays, friendly arcade competition, and more!Job Type: Full-timeSalary: $50,000.00 to $90,000.00 /yearExperience:Node.js: 3 years (Required)API consumption: 1 year (Required)Javascript: 3 years (Required)Location:Lakewood, NJ 08701 (Preferred)Language:English (Required)"},{"content":"The Riveter is looking for an experienced software developer to collaborate with our technology team in creating a world class digital experience for our members. We are open to candidates anywhere in the USA. Our HQ is based in Seattle and we run our product team with members outside of the state.\n\nWhat You’ll Do:\nCollaborate with the product team to evaluate a product experience holistically, identify next steps, and deliver the individual features that make up the product\nObjectively explain and represent your contributions and deliverables to your team\nClearly communicate with your project team to make sure they have full context of your work and that you have the same of theirs, jumping in on other tasks as needed to bring the most value to the system\nTake on various tasks, development-related or not, to support different processes and needs on your project teams\n\nYou’re Our Ideal Teammate if You Have:\n3+ years of full-stack experience in product development, from ideation to launch\nProven skills in React and/or React Native and JavaScript more generally\nFront end experience with CSS and preprocessors\nProficiency with the PHP language and the Laravel Framework, or similar\nFirm grasp on server operations, Linux system administration, and database design and optimization\nFamiliarity with building both functional and engaging web experiences\nPassion for principles & methods of Human Centered Design\nExperience with working in an iterative, adaptive, agile/lean way\nSolid time management skills and an inspiring attitude\nA commitment to improve software development practices for yourself and your team\nFamiliarity solving problems across multiple technology platforms (eg. browsers, applications, operating systems, mobile and connected devices, other hardware)\n(Preferred) Demonstrated practice w/test-driven/behavior-driven product development"},{"content":"The Riveter is looking for an experienced software developer to collaborate with our technology team in creating a world class digital experience for our members. We are open to candidates anywhere in the USA. Our HQ is based in Seattle and we run our product team with members outside of the state.\n\nWhat You’ll Do:\nCollaborate with the product team to evaluate a product experience holistically, identify next steps, and deliver the individual features that make up the product\nObjectively explain and represent your contributions and deliverables to your team\nClearly communicate with your project team to make sure they have full context of your work and that you have the same of theirs, jumping in on other tasks as needed to bring the most value to the system\nTake on various tasks, development-related or not, to support different processes and needs on your project teams\n\nYou’re Our Ideal Teammate if You Have:\n3+ years of full-stack experience in product development, from ideation to launch\nProven skills in React and/or React Native and JavaScript more generally\nFront end experience with CSS and preprocessors\nProficiency with the PHP language and the Laravel Framework, or similar\nFirm grasp on server operations, Linux system administration, and database design and optimization\nFamiliarity with building both functional and engaging web experiences\nPassion for principles & methods of Human Centered Design\nExperience with working in an iterative, adaptive, agile/lean way\nSolid time management skills and an inspiring attitude\nA commitment to improve software development practices for yourself and your team\nFamiliarity solving problems across multiple technology platforms (eg. browsers, applications, operating systems, mobile and connected devices, other hardware)\n(Preferred) Demonstrated practice w/test-driven/behavior-driven product development"},{"content":"As a leading worldwide provider of navigation devices and wearable technology, our focus is on developing, designing and supporting superior products. Our advanced technology promotes performance, safety and ease of use in every market we serve. That makes us an engineering and technology company with a keen focus on recruiting talent in those fields. With more than 13,000 associates in 60 offices around the world, we bring GPS navigation and wearable technology to the automotive, aviation, marine, outdoor and fitness markets. We think every day is an opportunity to innovate, and a chance to beat yesterday.\n\nARE YOU A MOBILE DEVELOPER WHO LOVES TO CREATE APPS THAT SOLVE COMPLEX PROBLEMS AND MAKE LIVES EASIER, SAFER AND MORE ENJOYABLE?\n\nTAKE YOUR CHANCE TO SUPPORT OUR TEAM. WE ARE LOOKING FOR THE NEXT POSSIBLE ENTRY DATE A\n\nIOS DEVELOPER (M/F/D) AVIATION\nYOUR RESPONSIBILITIES\nDevelop software in Objective C and Swift for Garmin products and/or applications in accordance with Garmin's coding methodology\nDevelop natively for iOS using Apple's development suite\nCreate functionality for features and take ownership of features as they evolve\nMay perform as a technical leader or Lead Software Engineer as you grow in this role\nCollaborate and add value through participation in peer code reviews, providing comments and suggestions\nProvide reliable solutions to a variety of problems using sound problem-solving techniques\nEstimate level of effort, evaluate new options of similar technology, offer suggestions to improve processes, and provide comments on some electrical design aspects\nWork collaboratively and professionally with other Garmin associates in cross functional teams to achieve goal\nYOUR PROFILE\nDegree in a Technical field such as Computer Science, Electrical Engineering, Computer Engineering, Aerospace Engineering, Math or Physics or other related a technical field\nDemonstrate proficient knowledge and utilization of engineering tools necessary for successful performance of the essential functions of this job description including:\nExperience to develop moderately complex software in Objective C and Swift.\nDemonstrated mastery of relevant software engineering tools (configuration management systems, build processes, debuggers, emulators, simulators logic analyzers) and demonstrate proficient ability to capture and document software requirements.\nExperience with aviation-related mobile applications\nPilot/flying experience\n\nWE OFFER\na challenging job with a home office oppurtunity in an open and communicative corporate culture.\n\nPlease provide your CV & cover letter in English language.\n\nDEIN ANSPRECHPARTNER\n\nMADELINE RÜGER\nHuman Resources\nGARMIN DEUTSCHLAND GMBH\nParkring 35 | 85748 Garching b. München\nTel. +49 (0) 89 - 858364 0"},{"content":"About the Role - You will:\nJoin an exciting team that’s crafting an entirely new software stack to facilitate data mobility and management across Seagate devices from the edge to the cloud.\n\nIn this role you’ll have an opportunity to develop a wide range of software including embedded device agents to cloud orchestration services.\n\nSpecific responsibilities include:\nDesigning and implementing Node.js and Express.js full-stack orchestration services for data mobility and device management in a large scale cloud environment\n\nDesigning and implementing a MongoDB solution for persistence of the managed objects\n\nImplementing REST APIs using OpenAPI and GraphQL for supporting the front end Vue.js based Web Interface\n\nCollaborate and interact with developers from across Seagate’s enterprise and consumer product lines\n\nInteract with product management and test organizations to scope solution requirements and software features to align with the delivery roadmap\n\nAbout Our Group:\nHighly motivated team within Enterprise Data Storage chartered with delivering applications and services to provide a cohesive management and data experience across Seagate’s consumer to enterprise devices.\n\nAbout You:\nPassion for developing software solutions\n\nHighly motivated developer that thrives on building software from concept to market\n\nEnjoys working on new product development with dynamic customer needs and requirements\n\nExcellent problem solver, communicator, and collaborator\n\nContinuously learning new technologies and methods, and sharing that knowledge with other developers to increase team capabilities\n\nYour Experience Includes:\nLanguage proficiency in javascript in a Node.js environment\n\nProficiency in Linux, C++\n\nDemonstrated success in delivering software solutions using Node.js, Express.js, and MongoDB\n\nExperience with Vue.js or Angular.js highly desired\n\nKnowledge of REST APIs and GraphQL a plus\n\nDevelopment experience in web applications, mobile applications, distributed systems, databases, networking, and/or software security highly desired\n\nFile and Object storage protocols highly desired\n\nAgile development methodologies\n\nBachelor's degree and/or relevant experience\n\nLocation: Longmont, CO\n\nTravel: less than 5%\n\nJob Family: Engineering Professional"},{"content":"We are looking for consultants to fill our immediate requirements. Positions involved in the complete software development lifecycle from requirements through design, coding, testing and deployment such as Java, .Net, Bigdata, Hadoop, Ui/Ux, python, Aws, Devops and other technologies Job description: 3+years of it industryHadoop,ScalaSparkHiveRequirements: BS/MS in Computer Science, Computer Engineering, MIS, or Similar FieldBasic Working Knowledge of Data Bases such as SQL, PLSQL (Preferred)Basic Working Knowledge of C, C++ (Preferred)Strong Communication Skills*Familiarity with Software Development Lifecycle (a definite plus, but not required)Visa Sponsorship: provided for qualified candidates, if required.If interested, please respond with your resumes today and reach me at 732-731-0281Job Types: Full-time, Part-time, Temporary, Internship, Contract, CommissionSalary: $60,000.00 to $80,000.00 /yearExperience:PL/SQL: 1 year (Preferred).NET: 1 year (Preferred)Administrative: 1 year (Preferred)Hive: 1 year (Preferred)C/C++: 1 year (Preferred)Education:Master's (Preferred)"},{"content":"US Citizenship is REQUIRED. Please DO NOT apply if you are NOT a US Citizen. We sponsor for Security Clearance which is required for this position. Looking for recent college grads or seniors in college. Candidate should have knowledge of software development and have experience in one or of the following: Java, J2EE, database development, Javascript, HTML, Web development, User interface design, Object Oriented methodology or any other related course work or experience. Please submit your resume for review. We are holding phone interviews and contingent offers including sponsorship for TS/SCI clearance will be granted to the right candidates.Job Type: Full-time"},{"content":"The Challenge:\nAre you looking for an opportunity to not just develop software, but to help build a system that will have a positive impact on the intelligence community (IC)? As a full-stack developer, you can solve a problem with a complete end-to-end solution in a fast-paced, agile environment. We’re looking for a developer with the skills needed to build enterprise applications in a Web environment from vision to production-ready system.\n\nThis role is more than just coding. We need a full-stack developer who will use their passion to learn new tools and techniques and identify needed system improvements. Using Agile life cycle development, you’ll work with the development team to build enterprise applications in a Web environment. You’ll analyze the needs and the environment to help make sure the solution the team develops considers the current architecture and operating environment, and future functionality and enhancements. Join us as we build systems to change the IC for the better.\n\nEmpower change with us.\n\nBuild Your Career:\nA challenging and dynamic work environment isn’t all we have to offer. When you join Booz Allen, you can expect:\naccess to experts in virtually every field\na culture that focuses on supporting our employees\nopportunities that provide stability while offering variety\n\nYou’ll also be exposed to a wealth of training resources through our Digital University, an online learning portal featuring more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We’ll help you develop the career you want, as you chart your own course for success.\n\nYou Have:\nExperience with multiple programming languages, including Java, C#, JavaScript, Ruby, Python, C, C++, or PerlExperience in working with relational databases, including Oracle, MySQL, or Microsoft SQLExperience with the systems development life cycleTS/SCI clearance with a polygraph requiredScheduled to obtain a BA or BS degree in 2020\nNice If You Have:\nExperience with software development methodologies, including Agile and othersAbility to translate client requirements into application designs and systems requirementsAbility to troubleshoot application and database issuesAbility to create software development design documentationPossession of excellent oral and written communication skillsPossession of excellent interpersonal, team leadership, development, and client relationship skills\nClearance:\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance with polygraph is required.\n\nWe’re an EOE that empowers our people—no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, veteran status, or other protected characteristic—to fearlessly drive change.\n\nURT1"},{"content":"The Challenge:\nAre you looking for an opportunity to not just develop software, but to help build a system that will have a positive impact on the intelligence community (IC)? As a full-stack developer, you can solve a problem with a complete end-to-end solution in a fast-paced, agile environment. We’re looking for a developer with the skills needed to build enterprise applications in a Web environment from vision to production-ready system.\n\nThis role is more than just coding. We need a full-stack developer who will use their passion to learn new tools and techniques and identify needed system improvements. Using Agile life cycle development, you’ll work with the development team to build enterprise applications in a Web environment. You’ll analyze the needs and the environment to help make sure the solution the team develops considers the current architecture and operating environment, and future functionality and enhancements. Join us as we build systems to change the IC for the better.\n\nEmpower change with us.\n\nBuild Your Career:\nA challenging and dynamic work environment isn’t all we have to offer. When you join Booz Allen, you can expect:\naccess to experts in virtually every field\na culture that focuses on supporting our employees\nopportunities that provide stability while offering variety\n\nYou’ll also be exposed to a wealth of training resources through our Digital University, an online learning portal featuring more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We’ll help you develop the career you want, as you chart your own course for success.\n\nYou Have:\nExperience with multiple programming languages, including Java, C#, JavaScript, Ruby, Python, C, C++, or PerlExperience in working with relational databases, including Oracle, MySQL, or Microsoft SQLExperience with the systems development life cycleTS/SCI clearance with a polygraph requiredScheduled to obtain a BA or BS degree in 2020\nNice If You Have:\nExperience with software development methodologies, including Agile and othersAbility to translate client requirements into application designs and systems requirementsAbility to troubleshoot application and database issuesAbility to create software development design documentationPossession of excellent oral and written communication skillsPossession of excellent interpersonal, team leadership, development, and client relationship skills\nClearance:\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance with polygraph is required.\n\nWe’re an EOE that empowers our people—no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, veteran status, or other protected characteristic—to fearlessly drive change.\n\nURT1"},{"content":"AvL Technologies, Inc. is a privately held U.S.-based company specializing in the design, development and production of mobile satellite antennas and positioner systems. With corporate headquarters based in Asheville, North Carolina, and a regional office located in the UK, AvL is able to offer superior service and support to customers around the world. AvL provides systems integrators with positioner and complete antenna system products, product development and services that maximize the technical and commercial benefits for their customers with cost, performance, quality and reliability requirements. AvL is a fast-paced organization that is driven to be the best satellite antenna designer and manufacturer in the industry.AvL is seeking an experienced Controls Software Developer in Asheville, NC, to lead the company’s software development team. The candidate will be responsible for developing software on Linux/Unix based platforms used primarily on satellite communications terminals. The candidate will develop software solutions including but not limited to instrument control, satellite tracking algorithms and precision closed loop motion control for a number of antenna terminals.Responsibilities:Drive innovation for new products and technologiesDevelop software architecturesDevelop sophisticated motion control algorithms for satellite trackingManage and mentor less experienced team membersPerform and review systems analysis, design, code, test, debug and create documentation for specific projectsSoftware development including configuration management and rigorous validation testingQualifications:BS in Computer Science or EE minimum; Master’s degree desired10+ years of experience in related positionExtensive experience in Control systems (servo motion control, DC and steppers, etc.)Extensive C/C++, C# programming skillsEmbedded software development experience on a Linux platformExperience with ARM processors desirableOther Requirements: Must be a U.S. CitizenRelocation packages available.AvL offers a competitive hourly wage plus company-matched 401(k), semi-annual profit sharing and bonuses, and a profit sharing contribution to your 401(k). AvL also provides company-paid health insurance for the employee.No third party submissions will be considered – principals only.AvL is an EEO employer.Job Type: Full-timeExperience:software development: 10 years (Required)Education:Master's (Preferred)Location:Asheville, NC (Required)Work authorization:United States (Required)"},{"content":"Job DescriptionThe Phynd Software Developer is responsible for maintaining and enhancing Phynd applications, and coordinate with the Phynd team working on various aspects of the platform. A commitment to collaborative problem solving, sophisticated design, and quality product is essential. This person must be a critical thinker who can efficiently solve problems and work well with a diverse team.This developer will contribute to team meetings and the overall engineering process. Must be diligent and coordinate multiple tasks within a team and understand the entire software development life cycle.Primary ResponsibilitiesCollaborate with Engineering Team, Implementation Managers, Implementation Support Engineers to maintain and enhance business products.Member of the Agile Development team composed of onshore and offshore members; participate in the Agile ceremonies: sprint planning, daily stand-ups, iteration review, and retrospective.Design, build, and maintain efficient, reusable, and reliable code based on design specifications.Integrate data storage solutions including relational and NoSQL databases.Ensure the best possible performance, quality, and responsiveness of the applications.Identify bottlenecks and defects, and devise solutions to mitigate and address these issues.Help maintain quality, organization, and automation of the platform’s code and data.Develop subject matter expertise in Phynd’s products and servicesQualificationsEducation & Experience: 1-3 years of experience building software applicationsBS in Computer Science preferred or a related field.Experience in the Healthcare industry is preferred.Knowledge, Skills, and Abilities: Experience working with a distributed development teamAbility to learn and pick up new languages and frameworks quicklyActively seeks knowledge into new languages, design patterns or technologiesStrong knowledge and experience with Structured Query Language (SQL) (Preferrably for MySQL)Proficient in JavaScript. Exposure to JavaScript frameworks like Node, React, JQuery, TypeScript, etcStrong analytical and problem-solving skillsExperience with RESTful API architecturesFamiliar with Amazon Web Services, or similar cloud service providerGood interpersonal communication skills with ability to work with other members in a teamFamiliar with Test Driven DevelopmentProficient understanding of code versioning tools such as Git, SVN, or Mercurial.Experience with Application Lifecycle Management (ALM) tools such as Rally, Jira, TFS etc.Strong understanding of object-oriented programmingSkill for writing reusable librariesFamiliar with various design and architectural patternsKnowledge of concurrency patternsKnack for writing clean, readable, and easily maintainable codeUnderstanding of fundamental design principles for building a scalable applicationBasic understanding of Common Language Runtime (CLR), its limitations, weaknesses, and workaroundsJob Type: Full-timeSalary: $100,000.00 to $125,000.00 /yearExperience:software development: 1 year (Required)Javascript: 2 years (Required)C#: 2 years (Required)SQL: 3 years (Required)Healthcare Industry: 1 year (Preferred)RESTful API: 1 year (Required)Education:Bachelor's (Required)Location:Omaha, NE (Required)Work authorization:United States (Required)Benefits offered:Paid time offHealth insuranceDental insuranceRetirement benefits or accountsEmployee discounts"},{"content":"Position SummaryWe are looking for a Senior ATG Developer to be part of the web commerce team that develops and supports the zenni.com web platform and related services. This position will be a valuable member of our team and is expected to provide senior level technical leadership for the ongoing development of the Oracle(ATG) Web Commerce framework.About YouYou are good at tackling complex problems and coming up with innovative solutions. You will become the go to person in short time and lead hands on development of the critical projects. You can quickly learn new business domain, programming languages and technologies. You always looking for answers and figuring out how s/w is currently being used to support business. You can juggle multiple tasks and manage expectation at the same time.Essentials DutiesDevelopment of Oracle Web Commerce(ATG) applications and support.Work with internal Business Analysts to collect and develop application requirements for added website functionality and improvements on existing applications.Interface with UX design team to ensure appropriate design is being developed.Participate in ongoing development and discussions initiatives as directed by the Director of Software Engineering & Management team.Researches new technology and ideas to enhance website and commerce functions.Participate in code reviews and resolve security and vulnerability issues as they arise.Implement development best practices and standards.Perform RCA and recommend changes for the problem issue ticketsMinimum Qualifications5+ years’ working experience on Oracle Web Commerce(ATG) version 11 or above.Strong OO programming skills and understanding of design patterns.Excellent J2EE design experience a plus.Good knowledge of SQL and database fundamentals(Oracle, MySQL).Endeca Search and navigation experience a plus.Knowledge of ecommerce best practices, frameworks and tools.Comfortable working in an agile/iterative development environment.Bachelor’s degree in Computer Science, Information Technology or related experience.Strong communication and collaboration skills, ability to communicate technical concepts to both technical and non-technical collaborators and stakeholders.Ability to work independently and also with local and remote team members.Experience working with Atlassian suite of applications (JIRA, Confluence, Bitbucket).Strong project management skills; can change course if needed to get things done within short timeframes to meet aggressive deadlines.Self-starter with ability to learn quickly; able to thrive in an exciting, fast-paced environment.Collaborative team player with a positive outlook and “can-do” attitude.Sound judgment; trustworthiness, strong personal integrity and work ethic.Job Type: Full-timeBenefits offered:Paid time offHealth insuranceDental insuranceHealthcare spending or reimbursement accounts such as HSAs or FSAsOther types of insuranceRetirement benefits or accountsWorkplace perks such as food/coffee and flexible work schedules"},{"content":"Position SummaryWe are looking for a Senior ATG Developer to be part of the web commerce team that develops and supports the zenni.com web platform and related services. This position will be a valuable member of our team and is expected to provide senior level technical leadership for the ongoing development of the Oracle(ATG) Web Commerce framework.About YouYou are good at tackling complex problems and coming up with innovative solutions. You will become the go to person in short time and lead hands on development of the critical projects. You can quickly learn new business domain, programming languages and technologies. You always looking for answers and figuring out how s/w is currently being used to support business. You can juggle multiple tasks and manage expectation at the same time.Essentials DutiesDevelopment of Oracle Web Commerce(ATG) applications and support.Work with internal Business Analysts to collect and develop application requirements for added website functionality and improvements on existing applications.Interface with UX design team to ensure appropriate design is being developed.Participate in ongoing development and discussions initiatives as directed by the Director of Software Engineering & Management team.Researches new technology and ideas to enhance website and commerce functions.Participate in code reviews and resolve security and vulnerability issues as they arise.Implement development best practices and standards.Perform RCA and recommend changes for the problem issue ticketsMinimum Qualifications5+ years’ working experience on Oracle Web Commerce(ATG) version 11 or above.Strong OO programming skills and understanding of design patterns.Excellent J2EE design experience a plus.Good knowledge of SQL and database fundamentals(Oracle, MySQL).Endeca Search and navigation experience a plus.Knowledge of ecommerce best practices, frameworks and tools.Comfortable working in an agile/iterative development environment.Bachelor’s degree in Computer Science, Information Technology or related experience.Strong communication and collaboration skills, ability to communicate technical concepts to both technical and non-technical collaborators and stakeholders.Ability to work independently and also with local and remote team members.Experience working with Atlassian suite of applications (JIRA, Confluence, Bitbucket).Strong project management skills; can change course if needed to get things done within short timeframes to meet aggressive deadlines.Self-starter with ability to learn quickly; able to thrive in an exciting, fast-paced environment.Collaborative team player with a positive outlook and “can-do” attitude.Sound judgment; trustworthiness, strong personal integrity and work ethic.Job Type: Full-timeBenefits offered:Paid time offHealth insuranceDental insuranceHealthcare spending or reimbursement accounts such as HSAs or FSAsOther types of insuranceRetirement benefits or accountsWorkplace perks such as food/coffee and flexible work schedules"},{"content":"ULTRAMAIN SYSTEMS, INC.® is looking for an experienced Web Architect to join our our aviation software development and support team at our headquarters in Albuquerque. This is a full-time position with benefits.Job PurposeTo architect, design, implement and document web-based solutions (including server-side and UI components) to aviation challenges.Duties IncludeArchitect secure web infrastructure to support mobile applications within AWS and customer hosted environments.Design and develop user interfaces and business logic for web applications.Front end development using JavaScript and Vue.js or React. Build and consume custom SOAP and REST APIs in Java.Completes application development by coordinating requirements, schedules, and activities; contributing to team meetings; troubleshooting development and production problems across multiple environments and operating platforms.Supports users by developing documentation and assistance tools.Updates job knowledge by researching new technologies and software products and recommending best practices approach.Enhances organization reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to the team.Requirements2+ years of experience with JavaScript (modularized / functional code, callbacks, DOM manipulation, async processing), HTML, CSSExperience in Vue or React preferredExperience in Java, Java EE, EJB3, JAXB, Networking/Communication, Security a plusJava certification a plusFamiliarity working in an Agile/Scrum development processSome background in the aviation industry preferred but not requiredMust possess excellent analytical and communication skills, be detail oriented, and able to work with minimum supervisionMust be flexible, able to take on new projects in varied environments, and must be able to research and learn new technologies independently4 year Degree requiredRelocation to Albuquerque is MandatoryULTRAMAIN SYSTEMS, INC.® is an equal opportunity employer. This is a paid full-time position with benefits to include:International TravelMedical, Dental, Vision and Life InsurancePrivate Concierge Doctor401(k) PlanHolidays, Vacation & Sick LeaveDog Friendly EnvironmentOnsite GymCasual DressFor more information on our company, please visit our website at www.ultramain.com.Job Type: Full-timeExperience:JavaScript, Java, React, Vue, HTML, CSS, SCSS, SPA: 2 years (Preferred)Benefits offered:Paid time offParental leaveHealth insuranceDental insuranceHealthcare spending or reimbursement accounts such as HSAs or FSAsRetirement benefits or accountsGym memberships or discountsCommuting/travel assistanceFlexible schedulesWorkplace perks such as food/coffee and flexible work schedulesOthersOther types of insurance"},{"content":"About the CompanyVisual Robotics is a Eugene, Oregon-based startup developing transformational vision guidance systems for industrial robots. Our patent-pending Vision-in-Motion™ camera technology is a disruptive game changer enabling robots to perform tasks that were previously impossible.We also have a vision for transforming the user experience in setting up and operating industrial robots. To accomplish that, we are creating a PC-based application (Windows 10) that makes setting up a robot as easy as using a toaster.Job DescriptionWe are seeking an experienced Windows application software engineer to join our team working in our Eugene, OR office, and help us bring these transformational products to market. You must have a passion for creating not only a state-of-the-art user experience but for building top-notch application infrastructure on the Windows stack.Our goal is to build a team of software professionals who are steeped in software technology, design best practices, testing practices, and have a general passion for building bullet-proof code that is maintainable and extensible.Please do not apply unless you have a minimum of five (5) years of professional experience developing Windows applications.To learn more about the company including video demonstrations of our products, visit our website at: www.VisualRobotics.com.Requirements: Proven track record delivering high quality software on Windows5+ years working on commercial projects (post-education)Commitment to, and substantial knowledge of, best practices for software developmentAbility to translate end user requirements into software feature, architecture, and to codeStrong knowledge of C#, C, C++, PythonStrong communication and collaboration skillsAgile development process experienceCS degree or equivalent knowledge and experiencePreferred: Windows driver development experienceCommercial software product development (vs. internal IT apps)Experience working with embedded software developers or even doing embedded developmentJob Type: Full-timeSalary: $75,000.00 to $100,000.00 /yearExperience:Python: 5 years (Preferred)C/C++: 5 years (Preferred)Windows Driver Dev't: 1 year (Preferred)commercial Windows SW Dev't (not school): 5 years (Preferred)"},{"content":"About the CompanyVisual Robotics is a Eugene, Oregon-based startup developing transformational vision guidance systems for industrial robots. Our patent-pending Vision-in-Motion™ camera technology is a disruptive game changer enabling robots to perform tasks that were previously impossible.We also have a vision for transforming the user experience in setting up and operating industrial robots. To accomplish that, we are creating a PC-based application (Windows 10) that makes setting up a robot as easy as using a toaster.Job DescriptionWe are seeking an experienced Windows application software engineer to join our team working in our Eugene, OR office, and help us bring these transformational products to market. You must have a passion for creating not only a state-of-the-art user experience but for building top-notch application infrastructure on the Windows stack.Our goal is to build a team of software professionals who are steeped in software technology, design best practices, testing practices, and have a general passion for building bullet-proof code that is maintainable and extensible.Please do not apply unless you have a minimum of five (5) years of professional experience developing Windows applications.To learn more about the company including video demonstrations of our products, visit our website at: www.VisualRobotics.com.Requirements: Proven track record delivering high quality software on Windows5+ years working on commercial projects (post-education)Commitment to, and substantial knowledge of, best practices for software developmentAbility to translate end user requirements into software feature, architecture, and to codeStrong knowledge of C#, C, C++, PythonStrong communication and collaboration skillsAgile development process experienceCS degree or equivalent knowledge and experiencePreferred: Windows driver development experienceCommercial software product development (vs. internal IT apps)Experience working with embedded software developers or even doing embedded developmentJob Type: Full-timeSalary: $75,000.00 to $100,000.00 /yearExperience:Python: 5 years (Preferred)C/C++: 5 years (Preferred)Windows Driver Dev't: 1 year (Preferred)commercial Windows SW Dev't (not school): 5 years (Preferred)"},{"content":"Who we areCurve Dental is the leading provider of cloud-based practice management software for the dental industry. With development operations based in Calgary for over 12 years, we recently received private equity investment from Battery Ventures, a global, technology-focused investment firm, to accelerate our growth in the market.We are passionate and committed to sound software development techniques and methodologiesWe believe in the power of open source and cloud-computingWe encourage our team members to teach us new things through their unique perspectives and experiencesWe respect the diversity in our team and the positive influence it has on our cultureWho we are looking forAs a member of the software development team, your focus will be transforming and optimizing the customer onboarding process in order to move new customers from competing products onto the Curve platform.This isn't a traditional ETL or BI developer position. You will be well versed in programming (preferably OO) with an understanding of and strong interest in data integration patterns. You bring with you a desire to build a DevOps mindset to transform a traditional computing process into a cloud-native computing platform that can leverage the power of the cloud (AWS) to digest large quantities of data and complete a burstable job in hours rather than days.To start with, you will spend time getting to know our data model and improving the automation tools we already have. Then you'll move on to creating new functionality and dealing with new types of data. Once all of our command line tools are in place, there'll be an opportunity to move on to building and maintaining robust web applications using technologies like Angular to allow users (both Curve staff and new clients) to control these processes themselves.Things we’re looking for in terms of more specific skill-sets and experience: Degree, Diploma, Certificate in Computer Science or a related technical discipline (or equivalent work experience)Strong software development background (PHP is a bonus but not required)Knowledge of relational databases and experience with SQL scripting / stored procedures (PostgreSQL experience is a bonus but not required)Experience with test driven development and a passion for making sure the code you write has good test coverageExperience with Linux (command line) or, at least, a desire to become experiencedSome things that would be nice to have but not totally required: Experience with ETL tools and processes such as data analysis, database conversion, data mining or data migrationExperience in an object-oriented programming languageExperience using an MVC framework such as Ruby on RailsExperience with systems that deal with dental or medical dataBasic shell scriptingHow to ApplySend us your resume. Don't just send us your standard cover letter with the resume; simply answer the following 3 questions:What do you know about our business and industry?Why is what we do important to our clients?What is your favourite aspect of our business, and why?This particular role is at Curve Dental's office in Orem, UT, USA.Job Type: Full-timeExperience:software development: 5 years (Preferred)Education:Bachelor's (Preferred)Location:Orem, UT (Preferred)Language:English (Required)Work authorization:United States (Required)"},{"content":"Must be a US Citizen or Green Card Holder\nEstimated duration of 12 months with the potential for extension or conversion.\nW2 with full benefits\nCustomer and contract specific training will be required and provided.\n==\n\nJob Description:\nWill be responsible for maintaining and upgrading the LabVIEW software used to operate the Cold Atom Laboratory (CAL) instrument located on the International Space Station. Responsibilities include flight software documentation and configuration management. Will be responsible for updates to requirements and software architecture. Will be responsible for developing, testing and integrating new software capabilities and bug fixes. Will be required to collaborate with other CAL project team members and be flexible as the project/task evolves in reaction to new requirements.\n\nRequired Skills:\nMust be a US Citizen or Green Card HolderOffer contingent on ability to successfully pass a background check and drug screenRequires a Bachelor's degree in Electrical, Computer Science, Software Engineering, or related discipline with a minimum of 12 years of related experience; Master's degree with 10 years of related experience; or PhD with 8 years of related experience.This position may be advertised at one level higher based on the qualifications of the applicants.Experience with formal software deliveries. Demonstrated expertise in developing measurement and control systems using LabVIEW FPGA, and LabVIEW Real-Time.Demonstrated expertise in developing requirements for measurement and control systems based on user needs. Demonstrated ability to exercise discretionary and independent judgement in evaluating potential approaches and solutions to instrumentation problems. Proven decision-making and problem solving skills, including the ability to troubleshoot highly complex measurement and control systems. Significant knowledge of Commercial off-the-Shelf (COTS) instrumentation and sensors. Demonstrated expertise in developing measurement and control systems using LabVIEW for Windows. Experience with the National Instruments hardware platform. Working knowledge of digital electronics, digital data busses, protocols, and systems implemented with digital electronics. Experience and/or understanding of hardware/software interfaces. Experience with standard lab test equipment, such as power supplies, oscilloscopes and Digital Multimeters (DMMs). Excellent written and verbal communications skills. Strong interpersonal skills with demonstrated effectiveness in a team environment. Ability to work independently under a set schedule. Proven ability to establish task priorities and manage change as the project/task evolves in reaction to new requirements. Capability to advise the project/ management on instrumentation industry trends that can either obsolete or improve a measurement and/or a control system.\nDesired Skills :\nCertified LabVIEW Developer (CLD), Certified LabVIEW Architect (CLA), and/or Certified LabVIEW Embedded Developer. Experience with UNIX or Linux operating systems. Experience with scripting language (e.g. TcL, Perl, Ruby, Lua, etc...). Experience working with IT and network security groups within a large organization. Experience with development and delivery of software documentation procedures, such as requirements documents, software interface documents and user guides."},{"content":"Codeware is seeking a full-time Salesforce APEX Developer to join our Sarasota-based Software Development Team. We have positions available at both the junior and intermediate levels.\n\nCodeware provides a competitive salary and benefits package to all full-time employees.\n\nPosition Responsibilities\n\nApplies the latest programming concepts and tools to further develop Codeware’s internal systems.Assists with refactoring the established code base.Performs application profiling to optimize performance.Assists with other projects as assigned.\nPosition Requirements\n\nQualifications (Junior Level)\n\nBachelor’s degree in Computer Science or related field\nQualifications (Intermediate Level)\n\nBachelor’s degree in Computer Science (or related field) and 5 years work experience or a Master’s degree in Computer Science (or related field) and 3 years work experience\nSkills\n\nExperience with Salesforce Apex Development (Classes & Triggers)Understanding and designing Process Builders and WorkflowsExperience with a DML (SQL | SOQL, Data Loader)Experience using REST/SOAP APIsAbility to create Visualforce pages and Lightning ComponentsGood understanding of the Salesforce ArchitectureExperience with programming in CSS, HTML, JSON, XML & JavaScriptExperience with Salesforce CPQ is a plusKnowledge of C++, C#, .NET is a plus\nCharacteristics\n\nSolution-oriented and user focused.Able to work independently as well as part of a team.Able to communicate project progress in a clear and concise manner.Strong analytical and creative problem solving skills.Comfortable asking questions.Good organizational and planning skills.Committed to professional advancement through continuous learning.\n"},{"content":"The Systems and Analysis Group provides technical analyses to senior USAF leadership on a broad range of issues, including survivability of advanced USAF aircraft versus modern air defenses; the impact of current and future electronic attack and electronic protection techniques; the effectiveness of advanced weapon systems; the capabilities and limitations of intelligence, surveillance, and reconnaissance systems; and the vulnerability of precision-guided munitions to threat counters. Many of these system analyses rely on a large body of modeling and simulation tools for RF, infrared, GPS, and directed-energy systems, which are validated via participation in an active program of laboratory measurements and flight testing in conjunction with Group 108, Tactical Defense Systems. In other cases, new models, supported by measurements and tests when feasible, are developed to evaluate new USAF capabilities. Where a rapid capability is sought, the group may lead multi-group coalitions in the execution of these efforts.\n\nJob Description\n\nSoftware Developer/Tester will work with more senior members of the Group in a multidisciplinary team to develop simulation tools to address a broad range of technical problems of interest to the US Air Force and DoD. Technical areas of analysis requiring modeling and simulation tools include radar, infrared sensors, electronic warfare and GPS.\n\nRequirements:\nBA or BS in Computer Science, Computer Engineering or BA or BS in Physics, Mathematics, Engineering with experience in software development. 0-3 years of experience. Demonstrated ability to program in a technical environment in C or C++ required. Demonstrated ability to program in a technical environment in MATLAB or FORTRAN desired.\n\nMIT Lincoln Laboratory is an Equal Employment Opportunity (EEO) employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran status, disability status, or genetic information;\n\nU.S. citizenship is required."},{"content":"Selectron Technologies, Inc. is seeking a smart and talented entry level software developer, who can demonstrate progressive learning and broad capabilities through past experience and projects. Ask yourself, are you a problem solver? Are you proud of the software you have delivered in the past? Are you motivated to write production-level code, today? If so, we offer a team-centered environment that will facilitate your growth as a software professional. We want someone who is realistic about software design decisions; someone with self-discipline who enjoys owning their challenges, getting the job done, and moving on to the next challenge.\n\nThe Position\nYou’ll be working as a member of an experienced and highly productive development team. Engineering is key to what we do as a company, so expect to be in daily contact with people from many non-engineering departments, in addition to collaboration with other internal and external engineers. The environment is fun, focused, challenging, and ever-changing. The position requires skill and creativity, as expressed through software development, peer collaboration, technical investigation, and customer communication.\n\nKey Responsibilities\nBachelor’s degree in Computer Science or related discipline or equivalent work experience\n1-3 years of professional software development experience\nDelivery of commercial quality software solutions.\nGood working knowledge of: C# .NET; SQL Server; Team Foundation Server\nExperience with Agile Development software principles and tools, including release management, source control, QA, design documentation, defect management, and Continuous Integration preferred\nAptitude in organizational, interpersonal, written, and verbal communication skills\nStrong analytical skills and attention to detail\nAble to perform comfortably in a fast-paced, deadline-oriented work environment. Able to triage concurrent projects and effectively communicate status to team members and management\nOpen to continuous learning\nExperience with VOIP and VXML solutions a plus"},{"content":"*****Applicants are required to be eligible to lawfully work in the U.S. immediately; employer will not sponsor applicants for U.S. work authorization (e.g. H-1B visa) for this opportunity***********\n\nRequisition ID:\nreq6017\n\nJob Title:\nSoftware Developer - Mainframe\n\nNumber of Openings:\n3\n\nJob Category:\nProfessional/Technical\n\nEmployment Type:\nRegular Full-Time\n\nShift:\nFirst\n\nWeekends:\nPeriodic\n\nLocation:\nBloomington, IL\n\nAre you dynamic, inter-active, and agile? Does end-to-end ownership of core products in a small-team setting peak your interest? Come be part of an empowered small-team designing, developing, testing, and deploying applications/services/tools to support foundational Life products. Innovate and continuously deliver LINUX solutions that serve both internal and external customers.\n\nDuties and Responsibilities:\nDesign, develop, and test new solutions utilizing continuous delivery services to applications as a member of a small, persistent and agile mainframe teamBuild and support integration of applications and tools to successfully deliver end-to-end solutionsBe comfortable consuming new technologies and work with innovation teams to streamline deliveryExpected skills in: MicroFocus Cobol, Linux server programming environment, Linux shell scripting, JCLDesirable skills in: C / C++, JavaSE, IBM DB2 for Linux/Unix/Windows/MVS, IBM MQ, SAS\nPossesses an understanding of how technology solutions meet the business outcomes and offers a range of solutions for business partners\nParticipates in sprint planning; provides work estimates to deliver product stories; owns development stories\nDevelops solutions on variety of platforms according to business requirements\nCompletes required coding to satisfy the defined acceptance criteria and deliver desired outcome\nLeads solution design, considering risks, mitigations, performance, user experience, and testability\nAssists in development of automated testing and supporting code as necessary\nCompletes required documentation to communicate information to deployment, maintenance, and business teams\nUtilizes agile software development practices, coding, data and testing standards, secure coding practices, code reviews, source code management, continuous delivery and software architecture\nParticipates in the full software development cycle including coding, testing, implementation, support and sunset\nDesigns, develops, tests and supports software in support of big data objectives\nPossesses an understanding of User Experience practices to improve usability and interaction between the customer and product\nAdopts Service Design, where appropriate, through architecture modularity to enable continuous delivery\nConsiders applying emerging technology solutions to increase efficiency and effectiveness; expectation of continuous innovation\nResolves problems that result in a decreased time to market; improves quality, enhances flexibility, and embraces the solution provider mindset\nProvides input into overall testing plan; contributes to test approach and scenarios for requirements\nProvides product and/or process expertise necessary to support design, development, testing and execution of solutions\nExhibits DevOps mindset where team is accountable for product from inception to sunset\n\nAdditional Details:\nThis position will have an 18-month incumbency period, beginning on the effective date of the position, which must be met before the employee can post for any other lateral State Farm position. Employees may be considered for leadership or Technology Engineer openings at any time, and a promotional position within the same job structure (i.e. Professional/Technical or Para-professional/Support) after 6 months from the effective date of the position. In these cases, the remaining incumbency would be waived. The incumbency period does not affect the at-will relationship between State Farm and the employee and does not create an employment contract, nor contractual rights.\n\nJob may require travel via commercial transportation and/or driving motor vehicles\nJob may require irregular work hours and travel outside normal business hours\n\nSFARM\n#LI-LF1"},{"content":"PURPOSE OF THE ROLE\n\nThe Entry Level Software Developer will be primarily responsible for developing and maintaining software applications spanning a wide range of operating systems, application platforms, languages, databases, web and backend services. The individual will also gain experience working with other IT areas, including networking, systems and operations , as well as general user support.\n\nKEY TASKS & RESPONSIBILITIES\nHelps maintain and takes responsibility for existing applications.\nAssists with design, coding, benchmark testing, debugging and documentation of new programs.\nParticipates in the development of testing and monitoring systems.\nProvides the technical background and skills to perform in software design, development, documentation, and implementation.\nMonitors the availability and functionality of production systems.\nRecommends and implements security enhancements.\nResponds to ad-hoc requests for data analyses.\nServes as a backup to various IT network, systems and operations personnel.\nQUALIFICATIONS\nBachelor’s Degree or higher in Computer Science, Mathematics or other Engineering or Technical discipline is preferred.\nA firm grasp of Computer Science fundamentals including object oriented design, data structure, algorithm design, problem solving and complexity analysis.\nStrong aptitude for programming and problem solving\nAbility to provide functional and empirical analysis related to the design, development, and implementation of software systems.\nNo previous experience required\nPROFESSIONAL SKILLS, EXPERIENCE & COMPETENCIES\nWilling to Travel as needed\nExcellent communication/organization skills, both written and verbal\nAble to interact with all levels and areas of the Company\nAble to support multiple tasks, initiatives, and projects simultaneously\nSelf-motivated; Positive attitude\nCollaborative work style with strong ability to network and build relationships\nMust be able to remain in a stationary position 50%\nMust be able to occasionally move about inside the office to access file cabinets, office machinery, etc.\nConstantly operates a computer and other office productivity machinery, such as a calculator, copy machine and computer/printer\nMust be able to move/transport equipment/office supplies weighing up to 25 pounds\nJob Type: Full-time\n\nJob Location: Beaumont, TX\n\nRequired education: Bachelor's (Preferred Degree in Computer Science, Engineering or Mathematics)"},{"content":"PURPOSE OF THE ROLE\n\nThe Entry Level Software Developer will be primarily responsible for developing and maintaining software applications spanning a wide range of operating systems, application platforms, languages, databases, web and backend services. The individual will also gain experience working with other IT areas, including networking, systems and operations , as well as general user support.\n\nKEY TASKS & RESPONSIBILITIES\nHelps maintain and takes responsibility for existing applications.\nAssists with design, coding, benchmark testing, debugging and documentation of new programs.\nParticipates in the development of testing and monitoring systems.\nProvides the technical background and skills to perform in software design, development, documentation, and implementation.\nMonitors the availability and functionality of production systems.\nRecommends and implements security enhancements.\nResponds to ad-hoc requests for data analyses.\nServes as a backup to various IT network, systems and operations personnel.\nQUALIFICATIONS\nBachelor’s Degree or higher in Computer Science, Mathematics or other Engineering or Technical discipline is preferred.\nA firm grasp of Computer Science fundamentals including object oriented design, data structure, algorithm design, problem solving and complexity analysis.\nStrong aptitude for programming and problem solving\nAbility to provide functional and empirical analysis related to the design, development, and implementation of software systems.\nNo previous experience required\nPROFESSIONAL SKILLS, EXPERIENCE & COMPETENCIES\nWilling to Travel as needed\nExcellent communication/organization skills, both written and verbal\nAble to interact with all levels and areas of the Company\nAble to support multiple tasks, initiatives, and projects simultaneously\nSelf-motivated; Positive attitude\nCollaborative work style with strong ability to network and build relationships\nMust be able to remain in a stationary position 50%\nMust be able to occasionally move about inside the office to access file cabinets, office machinery, etc.\nConstantly operates a computer and other office productivity machinery, such as a calculator, copy machine and computer/printer\nMust be able to move/transport equipment/office supplies weighing up to 25 pounds\nJob Type: Full-time\n\nJob Location: Beaumont, TX\n\nRequired education: Bachelor's (Preferred Degree in Computer Science, Engineering or Mathematics)"},{"content":"Delivers systems solutions by applying an understanding of business and functional processes through consulting with supervisor, systems analysts, other software developers, and end users to gather information about program intent, functions, features, data requirements, input requirements, output requirements, internal and external checks and controls, hardware and operating system environment, and interfaces with other system.Experience with C++, Java/J2EE, C#, JavaScript, jQuery, and other web technologiesExperience with Oracle, SQL Server databasesExperience with web and enterprise technologies such as Spring MVC, JAX-RS,Hibernate, Java Message Service (JMS), jQueryConceptual understanding of framework methodologies such as Agile andWaterfall method as well as SDLC’sAbility to gain solid working knowledge on various programming languages, techniques, and best practices.Ability to work independently with limited general supervision.Ability to set priorities and manage multiple projects simultaneously.Ability to quickly learn new technologies and develop applicationsAbility to work in a team environment.Job Type: Full-timeExperience:SDLC: 3 years (Required)Agile and Waterfall method: 3 years (Required)C++, Java/J2EE, C#, JavaScript, jQuery: 3 years (Required)Spring MVC, JAX-RS, Hibernate, Java Message Service (JMS), j: 3 years (Required)Oracle, SQL Server databases: 3 years (Required)Education:Bachelor's (Required)Location:Memphis, TN (Required)Work authorization:United States (Required)"},{"content":"Delivers systems solutions by applying an understanding of business and functional processes through consulting with supervisor, systems analysts, other software developers, and end users to gather information about program intent, functions, features, data requirements, input requirements, output requirements, internal and external checks and controls, hardware and operating system environment, and interfaces with other system.Experience with C++, Java/J2EE, C#, JavaScript, jQuery, and other web technologiesExperience with Oracle, SQL Server databasesExperience with web and enterprise technologies such as Spring MVC, JAX-RS,Hibernate, Java Message Service (JMS), jQueryConceptual understanding of framework methodologies such as Agile andWaterfall method as well as SDLC’sAbility to gain solid working knowledge on various programming languages, techniques, and best practices.Ability to work independently with limited general supervision.Ability to set priorities and manage multiple projects simultaneously.Ability to quickly learn new technologies and develop applicationsAbility to work in a team environment.Job Type: Full-timeExperience:SDLC: 3 years (Required)Agile and Waterfall method: 3 years (Required)C++, Java/J2EE, C#, JavaScript, jQuery: 3 years (Required)Spring MVC, JAX-RS, Hibernate, Java Message Service (JMS), j: 3 years (Required)Oracle, SQL Server databases: 3 years (Required)Education:Bachelor's (Required)Location:Memphis, TN (Required)Work authorization:United States (Required)"},{"content":"Job Location Multiple locations (USA)\nJob Posted On 07/13/2016\nDescription\nVertraus Inc. is a US-based Global IT solutions company and Certified Minority Enterprise by NCTRCA providing Consulting, Technology and Staffing solutions for business. We work with customers to design and implement solutions that deliver the business outcomes they need to reach their own goals and objectives.\n\nMinimum Education Requirements:\nBachelor’s degree in computer science or related technical discipline.\n\nExperience:\nDeveloping Source Code by analyzing the requirements and test the functionality of Web Applications using JDK, Core Java ,Spring framework, XML, HTML, JSP, Hibernate, JavaScript, JQuery, Soap Web services, UNIX, Tomcat, AJAX, JMS, Web Sphere Application server, Serena ,SVN , ORACLE, RAD ,COREFTP, Eclipse ,FileZilla, SoapUIPro, PL/SQL developer.\n\nBenefits:\nWill Sponsor H1B Visa and Green Card\nWill provide Medical Insurance"},{"content":"Position OverviewThe Web Services Developer builds the web services, APIs, and database management logic that provide the framework upon which our front-end and third-party solutions integrate back into our core systems. As a Web Services Developer, you will be working on building scalable, responsive and highly available web-services. Your responsibilities will include all the phases of Web Services development. From architecture design and technology selection to implementation and deployment. These services will require you to work with our internal technology teams and external third-party providers to integrate to their solutions. We have several key projects focused around 3rd party Loigistic warehouses, automating our order entry processes and launching our first IoT enabled product to market. This position will be in our Middleville, Michigan location and report to our Director IT Business Partnerships.Duties and ResponsibilitiesAs a web service developer, you will be responsible for the design, development and unit tests of web service (SOAP/REST) integrations.Integration of third-party APIs and connection to our Oracle EBS APIsParticipate in requirement, design discussions, and come up with solution according to functional specifications.Translate highly complex business requirements into technical solutions through efficient design and using appropriate tools and technologiesProvides support for overall systems testing and implementation into the productionTroubleshooting production issues and solution implementationWork with analysts and business teams and provide solution for business problemsCreate necessary technical documentationAdhere to the established SDLC processes and best practicesExperience/RequirementsBS degree in computer science or related field, equivalent experienceExperience in building web services and familiarity with HTTP, REST, JSONAPI design and developmentWeb fundamentals like HTML, JavaScript, and CSSServer-side languages like PHP, Python, Ruby, Java, JavaScript, and .NetDatabase technologies like MySQL, Oracle, PostgreSQL, and SQL ServerSuccessful track record of developing quality software productsExperience working with Oracle EBS as backend ERP a definite plusGood verbal, written, and interpersonal communication skillsStrong problem solving and debugging skillsHighly motivated, self-confident, entrepreneurial mindset that fosters participation and contribution by othersBradford White is an Equal Opportunity EmployerJob Type: Full-timeExperience:Web Development: 3 years (Preferred)"},{"content":"About DataQuest corp: Dataquest Corp is an IT services company based in NJ offering a wide array of solutions customized for a range of key verticals and horizontal industries across USA. We consult with our clients to build effective organizations, innovate & grow, reduce costs, manage risk & regulation and leverage talent. We are an E-Verified company.We have a dedicated development team with amazing range of skills, deep vertical industries expertise and excellence in advanced technologies. By wise blend of business analysis & management with latest technology, Dataquest Corp designs and develops custom made software & web applications. We have a broad range of technology services that deliver real business results. Our main preference is to gain your trust through our commitment and integrity, extending maximum value to you and striving to exceed your expectations.Job Responsibilities: · 3+ years of experience in development using Scala. Any experience in Java development would be a plus· 3+ years of experience in Hadoop/Spark/Hive· Experience in front office (trading application) developmentQualifications: BS/MS in Computer Science, Computer Engineering, MIS, or Similar FieldBasic Working Knowledge of Data Bases such as SQL, PLSQL (Preferred)Basic Working Knowledge of C, C++ (Preferred)Strong Communication Skills*Familiarity with Software Development Lifecycle (a definite plus, but not required)Interested candidates can reach me at 732-731-0281freshers also can applyJob Types: Full-time, Part-time, Temporary, Internship, Contract, CommissionSalary: $60,000.00 to $80,000.00 /yearExperience:PL/SQL: 1 year (Preferred)Hive: 1 year (Preferred)Spark: 1 year (Preferred)Java: 1 year (Preferred)C/C++: 1 year (Preferred)Education:Master's (Preferred)"},{"content":"Overview\nAllied Associates is seeking a software developer to develop and maintain data processing and analysis applications in support of a federal customer. Responsibilities include end-user support, application development and maintenance, testing and validation of software builds, and the identification of enhancements and improvements to the customer’s data flow operations and capabilities.\n\nThe developer will also research operations, capabilities, and vulnerabilities for a variety of software components to include reverse engineering investigations and results documenting. Successful candidates will possess excellent documentation and communication skills as the position requires direct interaction with customer and engineer personnel of varying technical levels across different functions. The ability to take direction and operate independently as well as participate in team environments are necessary for this support effort.\n\nResponsibilities\nThe developer will be responsible for using industry standard and proprietary tools and methodologies for detecting vulnerabilities in software. They will provide network protocol analysis and data traffic analysis to identify malicious activity. The developer may also be required to work with a team to analyze secure mobile applications (Android and iOS) and identify security flaws in order to find and exploit weaknesses in encryption, secure storage, communications, and code execution vulnerabilities. This position will assist with the development of data analysis and recover software tools for these applications as well.\n\nQualifications\n\nThe ideal candidate will meet the following requirements:\nBachelor’s degree in computer science, computer engineering, or a related technical field.\n3-10 years of experience providing software development support to customers in a dynamic, proactive, and operational environment.\nKnowledge and experience in languages such as C#, C/C++, Java, Python, Perl or Bash Scripting\n\nAdditional desired skills:\nFamiliarity with network protocol analysis tools (e.g. wireshark, tcpdump)\nKnowledge of OS internals and compiler concepts\nStrong debugging and analytical skills\nKnowledge of TCP/IP network internals and open source tools\nExperience with industry-standard reverse engineering tools such as IDAPro, HexRays or OllyDbg\nExperience with Android or iOS environments\n\nApplicants must hold an active Top Secret (TS) clearance. Must also have the ability to successfully undergo a security-focused polygraph examination."},{"content":"JOB DESCRIPTIONSummary/Objective The Software Engineer is responsible for the design, development, and maintenance of complex multi-tier software applications based upon documented requirements. This individual will report to the Director of Reveal Labs and work closely with the Product Owner and a team of Software and QA Engineers. This person will have a demonstrated ability to use analytical skills and a keen attention to detail in order to design effective solutions that are appropriate to the development environment.Essential FunctionsWork with Product Owner and Project Manager in an Agile team environment to analyze, design, develop, configure, and maintain web applications and services utilizing a stack of modern technologies.Review and identify root cause and correct issues identified through user issue reporting or other system performance indicators.Standardizes and documents various practices and procedures.Assures quality by complying with relevant policies and procedures. Shares knowledge with other developers by participating in code reviews and group learning sessions.CompetenciesExpertise or experience - e.g., Oracle, MS SQL Server, etc.Experience in SOA - service oriented architectureProficiency in all phases of software development lifecycleExperience in development and maintenance of portal applications and integrationsFamiliarity with multi-tier architecture. Knowledge of Object-relational mapping (ORM) tools desired.Experience in development and maintenance of portal applications and integrations with experience in working with Java, Python, Javascript (Node, React, TypeScript), C++, Perl, RKnowledge of Jira, Confluence and Github for development operationsFamiliarity with multi-tier architecture. Knowledge of Object-relational mappingWillingness to adapt work hours to address critical needs.Excellent written and verbal communication skills.Knowledge of Agile methods and approaches like Scrum and KanbanProven ability to present architecture to a variety of stakeholders including senior leadership, customer liaisons and other leaders in business development and operations.Work EnvironmentThis job operates in a professional office environment. This role routinely uses standard office equipment such as laptop computers, photocopiers and smartphones. Remote work is authorized and equipment can be optimized to facilitate maximum productivity from the chosen work environment.Physical DemandsThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.While performing the duties of this job, the employee is regularly required to talk or hear. Specific vision abilities required by this job include close vision and ability to adjust focus. This would require the ability to lift files, open filing cabinets and bend or stand on a stool as necessary.Position Type/Expected Hours of WorkThis is a full-time position. Core work days and hours of work are Monday through Friday, 8:30 a.m. to 5 p.m. Occasional evening may be required as job duties demand. Work hours are flexible dependent upon work demands.TravelLittle to no travel is expected for this position.Preferred Education and Experience6-8 years of experience in the software development industry3-5 years leading agile teams and supervising a team of developersWork Authorization/Security Clearance (if applicable)US citizenship or Alien Registration (green card) as preferred but not necessaryAAP/EEO Statement The Company is an Equal Opportunity Employer. We believe it is our moral and legal obligation to meet the responsibility of ensuring that all management practices regarding employees are conducted in a nondiscriminatory manner.In compliance with Title VII of the 1964 Civil Rights Act, and other applicable federal and state statutes, all recruiting, hiring, training, and promoting for all job classifications will be administered without regard to race, color, religion, ancestry, age, sex, national origin, disability, military veteran status or other status protected by law, including state of employment protected classes.All personnel related activities such as compensation, benefits, transfers, job classification, assignments, working conditions, educational assistance, terminations, layoffs, and return from layoffs, and all other terms, conditions and privileges of employment will be administered without regard to race, color, religion, ancestry, age, sex, national origin, disability, military veteran status or other status protected by law, including state of employment protected classes.The success of the Company depends heavily on the employment and effective utilization of qualified persons regardless of race, color, religion, ancestry, age, sex, national origin, disability, military veteran status or other status protected by law, including state of employment protected classes. It is, therefore, our policy and intention to evaluate all employees and prospective employees strictly according to the requirements of the job.Other DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.*Job Type: Full-timeExperience:c++: 1 year (Preferred)Location:Fulton, MD (Preferred)Work authorization:United States (Required)Benefits offered:Paid time offParental leaveHealth insuranceDental insuranceOther types of insuranceWorkplace perks such as food/coffee and flexible work schedules"},{"content":"JOB DESCRIPTIONSummary/Objective The Software Engineer is responsible for the design, development, and maintenance of complex multi-tier software applications based upon documented requirements. This individual will report to the Director of Reveal Labs and work closely with the Product Owner and a team of Software and QA Engineers. This person will have a demonstrated ability to use analytical skills and a keen attention to detail in order to design effective solutions that are appropriate to the development environment.Essential FunctionsWork with Product Owner and Project Manager in an Agile team environment to analyze, design, develop, configure, and maintain web applications and services utilizing a stack of modern technologies.Review and identify root cause and correct issues identified through user issue reporting or other system performance indicators.Standardizes and documents various practices and procedures.Assures quality by complying with relevant policies and procedures. Shares knowledge with other developers by participating in code reviews and group learning sessions.CompetenciesExpertise or experience - e.g., Oracle, MS SQL Server, etc.Experience in SOA - service oriented architectureProficiency in all phases of software development lifecycleExperience in development and maintenance of portal applications and integrationsFamiliarity with multi-tier architecture. Knowledge of Object-relational mapping (ORM) tools desired.Experience in development and maintenance of portal applications and integrations with experience in working with Java, Python, Javascript (Node, React, TypeScript), C++, Perl, RKnowledge of Jira, Confluence and Github for development operationsFamiliarity with multi-tier architecture. Knowledge of Object-relational mappingWillingness to adapt work hours to address critical needs.Excellent written and verbal communication skills.Knowledge of Agile methods and approaches like Scrum and KanbanProven ability to present architecture to a variety of stakeholders including senior leadership, customer liaisons and other leaders in business development and operations.Work EnvironmentThis job operates in a professional office environment. This role routinely uses standard office equipment such as laptop computers, photocopiers and smartphones. Remote work is authorized and equipment can be optimized to facilitate maximum productivity from the chosen work environment.Physical DemandsThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.While performing the duties of this job, the employee is regularly required to talk or hear. Specific vision abilities required by this job include close vision and ability to adjust focus. This would require the ability to lift files, open filing cabinets and bend or stand on a stool as necessary.Position Type/Expected Hours of WorkThis is a full-time position. Core work days and hours of work are Monday through Friday, 8:30 a.m. to 5 p.m. Occasional evening may be required as job duties demand. Work hours are flexible dependent upon work demands.TravelLittle to no travel is expected for this position.Preferred Education and Experience6-8 years of experience in the software development industry3-5 years leading agile teams and supervising a team of developersWork Authorization/Security Clearance (if applicable)US citizenship or Alien Registration (green card) as preferred but not necessaryAAP/EEO Statement The Company is an Equal Opportunity Employer. We believe it is our moral and legal obligation to meet the responsibility of ensuring that all management practices regarding employees are conducted in a nondiscriminatory manner.In compliance with Title VII of the 1964 Civil Rights Act, and other applicable federal and state statutes, all recruiting, hiring, training, and promoting for all job classifications will be administered without regard to race, color, religion, ancestry, age, sex, national origin, disability, military veteran status or other status protected by law, including state of employment protected classes.All personnel related activities such as compensation, benefits, transfers, job classification, assignments, working conditions, educational assistance, terminations, layoffs, and return from layoffs, and all other terms, conditions and privileges of employment will be administered without regard to race, color, religion, ancestry, age, sex, national origin, disability, military veteran status or other status protected by law, including state of employment protected classes.The success of the Company depends heavily on the employment and effective utilization of qualified persons regardless of race, color, religion, ancestry, age, sex, national origin, disability, military veteran status or other status protected by law, including state of employment protected classes. It is, therefore, our policy and intention to evaluate all employees and prospective employees strictly according to the requirements of the job.Other DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.*Job Type: Full-timeExperience:c++: 1 year (Preferred)Location:Fulton, MD (Preferred)Work authorization:United States (Required)Benefits offered:Paid time offParental leaveHealth insuranceDental insuranceOther types of insuranceWorkplace perks such as food/coffee and flexible work schedules"},{"content":"Nira, Inc. is looking for a Lead .NET Developer to support a web-based case management system for a federal agency.This position requires US Citizenship or permanent residency (Green Card).Responsibilities include:Participant in lifecycle development of web-based applications following an Agile methodology, including requirement analysis, software, design and implementation, system testing.Lead or develop software components using Microsoft .NET technologies.Supporting the operation, maintenance, administration of the application and infrastructure, which Microsoft platform, J2EE application server, and Microsoft SQL Server.Working with customers to clarify requirements, and classify and prioritize user requests, bug fix requests, and operational issues reported by users.Recommending, evaluating, and performing system upgrades.Required SkillsMore than 7 years of solid working experience in software development using Object-Oriented Programming, ASP.NET and C#Experience with Microsoft Internet Information Server (IIS), windows service, web service, .Net remotingProficient in JavaScript, HTML & XML,CSS.A team player and strong communication skills.Desired SkillsTeam lead experience; Experience with one or more of the following technologies – Microsoft Message Queuing, MS Master Data Service (MDS), SQL server development and administration, SSRS, SSIS, ETL.NiRa offers a competitive compensation package, which include federal holidays and time off, fully employer-paid health insurance coverage and a 401 (k) retirement plan with generous employer matching.Job Type: Full-timeExperience:.Net: 3 years (Required)Education:Bachelor's (Required)Work authorization:United States (Required)Work Location:One location"},{"content":"Nira, Inc. is looking for a Lead .NET Developer to support a web-based case management system for a federal agency.This position requires US Citizenship or permanent residency (Green Card).Responsibilities include:Participant in lifecycle development of web-based applications following an Agile methodology, including requirement analysis, software, design and implementation, system testing.Lead or develop software components using Microsoft .NET technologies.Supporting the operation, maintenance, administration of the application and infrastructure, which Microsoft platform, J2EE application server, and Microsoft SQL Server.Working with customers to clarify requirements, and classify and prioritize user requests, bug fix requests, and operational issues reported by users.Recommending, evaluating, and performing system upgrades.Required SkillsMore than 7 years of solid working experience in software development using Object-Oriented Programming, ASP.NET and C#Experience with Microsoft Internet Information Server (IIS), windows service, web service, .Net remotingProficient in JavaScript, HTML & XML,CSS.A team player and strong communication skills.Desired SkillsTeam lead experience; Experience with one or more of the following technologies – Microsoft Message Queuing, MS Master Data Service (MDS), SQL server development and administration, SSRS, SSIS, ETL.NiRa offers a competitive compensation package, which include federal holidays and time off, fully employer-paid health insurance coverage and a 401 (k) retirement plan with generous employer matching.Job Type: Full-timeExperience:.Net: 3 years (Required)Education:Bachelor's (Required)Work authorization:United States (Required)Work Location:One location"},{"content":"Working at MIT offers opportunities, an environment, a culture – and benefits – that just aren’t found together anywhere else. If you’re curious, motivated, want to be part of a unique community, and help shape the future – then take a look at this opportunity.\n\nSOFTWARE DEVELOPER 1, Materials Science and Engineering (DMSE) (part-time, 50%), to support the Interactive Materials Education Laboratory’s teaching and research activities as directed by the lead research scientist. Will design, code, test and deploy production-ready software to support grant-funded research and teaching activities. Many of these tools will need to be integrated into the digital learning environments used in MIT residential and online education, specifically the edX platform. Will support grant-funded educational research to study the effect of deploying computer programming activities and interactive scientific computer graphics into college-level STEM curriculum and perform other tasks as needed.\n\nJob Requirements\n\nREQUIRED: bachelor’s degree in a STEM field; at least three years’ relevant programming experience; a background in or ability to quickly learn and translate domain-specific information (physics, mathematics, and materials science) into software development needs; experience creating, managing, and supporting software deployments; demonstrated experience working on educational software products; experience working with common scientific computing languages such as Wolfram Language; experience with web technologies including HTML, CSS, and JavaScript; demonstrated willingness to learn new technologies and platforms quickly; and technical expertise using LTI and OAuth HTTPS protocols. Teaching experience strongly preferred. Job #17460-8\n\nApplication material must include a cover letter.\n\nThis is a one-year, part-time (50%) position with the possibility of renewal contingent upon available funding."},{"content":"Client is looking only for GC/US CitizenSenior Developer for developing investment analysis, research and trading applications utilizing innovative technologies such as big data, machine learning and cloud.Develop software programs including design, build and test in various software technologies, application programs for asset management functions.Research into new and emerging technologies, work with the team to perform proof of concepts and document results.Deliver innovative designs of high complexity which allow building a scalable end to end architecture.Accountable for providing estimates and logical work plan to deliver applications on time and within budget that meets or exceeds quality standards.Perform analysis and evaluation of new data sources, products and solutions used in asset management space.Perform application sprint planning activities such as maintaining product backlog.Essential Duties and Responsibilities:Leverage in depth knowledge of multiple (new and emerging) technologies to design and implement strategic technical solutions in accordance with business needs.Interpret written business requirements, functional requirements and technical specification documents to design and develop technical solutions that meet business needs.Maintain project task lists and update timely. Provide status and progress updates to Manager.Collaborate with IT and Business partners to design, develop, and troubleshoot end to end technical solutions.Create and maintain technical documentation using defined technical documentation templates that meet SDLC standards.Perform system design and specification development, program logic and flow-charting that meets the stated project objectives.Identify and communicate technical risks, issues, and changes.Investigate, analyze and document reported defects.Required Qualifications1. Strong programming experience using Java/JEE technologies.2. Hands on development experience with Spring, Microservices, REST Services and python.3. Atleast 3+ years of hands on work experience with Big Data Development on Hadoop stack and related tools such as Solr, Hive, Pig, Spark etc.4. Ability to use a wide variety of open source technologies and cloud services.5. Experience with working on unix (linux) environment. (Shell scripting, Basic commands, unix editors)6. Experience with gathering and processing raw data at scale (including writing scripts, web scraping, calling APIs, write SQL queries, etc.).7. Experience with different database technologies Oralce, MongoDB or other nosql databases and ability to write queries, joins, DML and DDL.8. Familiarity with Development tools (Eclipse, git etc.), design/UML tools, profiling/tuning tools.9. Experience with DevOps or CI/CD process and related build/deploy tools (ANT/Maven/Serena/Nolio/Jenkins).10. Good understanding of enterprise architecture and operational procedures such as availability, recovery, archiving etc.11. Excellent communication and presentation skills. Experience communicating with senior investment professionals such as portfolio managers and traders.12. Knowledge of AI/Machine Learning and their use in asset management space.Strong Pluses: 1. Experience with following technologies a plusa. Vaadin (UI framework), Zaloni (Data Lake).b. Ability to develop shell scripts or other scripts (such as Perl/python/R).c. AWS or Google Cloud or Azure.d. Knowledge in data mining, machine learning, natural language processing, or information retrieval.2. Familiarity with order management, portfolio construction, reference data/market data etc.3. Strong analytical aptitude.Job Type: ContractSalary: $75.00 to $80.00 /hourExperience:Big Data Development: 3 years (Preferred)DevOps or CI/CD: 4 years (Preferred)shell scripts: 5 years (Preferred)Java/JEE: 9 years (Preferred)"},{"content":"**THIS POSITION REQUIRES AN ACTIVE TS/SCI WITH POLY CLEARANCE**\n\nBoeing Intelligence & Analytics (BI&A) is seeking a Computer Scientist with a strong mathematics background. Join this research-based project and enjoy the benefits of working with a proven high-caliber team. The team applies skills in hardware/software/system architecture for cutting edge machine learning techniques applied to error correction. The position involves the development of custom state-of-the-art machine learning algorithms used to implement error correction of processed data. This group offers upward mobility with the ability to strengthen technological capabilities.\n\nDUTIES WILL INCLUDE:\nAnalyze and model fault tolerant algorithms\nDevelop, analyze, and perform maintenance of machine learning algorithms\nExecute machine learning tests and experiments\nAbility to write robust code in Python and C++\nWork in a fast-paced, collaborative environment developing cutting edge advanced error models within a distributed team. The collaboration will include taking design input from stakeholders and providing implementable models. The individual is expected to contribute to the implementation effort by both developing and supporting development & test of the final solution\n\nREQUIRED EXPERIENCE:\nDeep knowledge of math, probability, statistics and algorithms\nExperience in developing error correction for fault tolerant systems\nExcellent communication skills\nRequirements interpretation, algorithm design & modelling\nOutstanding analytical and problem-solving skills\nFamiliarity with machine learning frameworks (like Keras or PyTorch) and libraries (like scikit-learn)\nFamiliarity with code repositories such as GIT\nAbility to read and interpret research papers\nKnowledge of computing equipment and its operating systems (e.g., Windows, Unix, Linux)\nDemonstrated creative, critical thinking and troubleshooting skills, strong collaborative skills, strong written and verbal communication\n\nEDUCATION REQUIREMENTS:\nBachelor’s degree in Mathematics, Electrical/Computer Engineering, Computer Science, or a related technical field with 2+ years of working experience; OR\nMaster’s degree in Mathematics, Electrical/Computer Engineering, Computer Science, or a related technical field with working experience\n\nDESIRED EXPERIENCE (although NOT required):\nR language\nMATLAB\nGPU programming\nFPGA development experience\nFamiliarity with the Agile (SCRUM) development methodology using continuous integration and delivery and Atlassian products\nBI&A is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n\nEqual Employment Opportunity is the Law (PDF)"},{"content":"**THIS POSITION REQUIRES AN ACTIVE TS/SCI WITH POLY CLEARANCE**\n\nBoeing Intelligence & Analytics (BI&A) is seeking a Computer Scientist with a strong mathematics background. Join this research-based project and enjoy the benefits of working with a proven high-caliber team. The team applies skills in hardware/software/system architecture for cutting edge machine learning techniques applied to error correction. The position involves the development of custom state-of-the-art machine learning algorithms used to implement error correction of processed data. This group offers upward mobility with the ability to strengthen technological capabilities.\n\nDUTIES WILL INCLUDE:\nAnalyze and model fault tolerant algorithms\nDevelop, analyze, and perform maintenance of machine learning algorithms\nExecute machine learning tests and experiments\nAbility to write robust code in Python and C++\nWork in a fast-paced, collaborative environment developing cutting edge advanced error models within a distributed team. The collaboration will include taking design input from stakeholders and providing implementable models. The individual is expected to contribute to the implementation effort by both developing and supporting development & test of the final solution\n\nREQUIRED EXPERIENCE:\nDeep knowledge of math, probability, statistics and algorithms\nExperience in developing error correction for fault tolerant systems\nExcellent communication skills\nRequirements interpretation, algorithm design & modelling\nOutstanding analytical and problem-solving skills\nFamiliarity with machine learning frameworks (like Keras or PyTorch) and libraries (like scikit-learn)\nFamiliarity with code repositories such as GIT\nAbility to read and interpret research papers\nKnowledge of computing equipment and its operating systems (e.g., Windows, Unix, Linux)\nDemonstrated creative, critical thinking and troubleshooting skills, strong collaborative skills, strong written and verbal communication\n\nEDUCATION REQUIREMENTS:\nBachelor’s degree in Mathematics, Electrical/Computer Engineering, Computer Science, or a related technical field with 2+ years of working experience; OR\nMaster’s degree in Mathematics, Electrical/Computer Engineering, Computer Science, or a related technical field with working experience\n\nDESIRED EXPERIENCE (although NOT required):\nR language\nMATLAB\nGPU programming\nFPGA development experience\nFamiliarity with the Agile (SCRUM) development methodology using continuous integration and delivery and Atlassian products\nBI&A is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n\nEqual Employment Opportunity is the Law (PDF)"},{"content":"Entry-Level Software Developersare in demand across USA You'll be matched and deployed to a development team in a strategic business, based on your offered location and fit.AZ - Tuscon, PhoenixCA - Almaden, Costa Mesa, Emeryville, Foster City, San Francisco, San JoseCO - DenverGA - Atlanta, Brookhaven, Sandy SpringsIL - ChicagoMA - Cambridge, LittletonMN - RochesterNC - Raleigh-DurhamNY - New York City, North Castle/Armonk, Poughkeepsie, Yorktown Heights, EndicottOH - DublinOR - HillsboroPA - Blue Bell, PittsburghTX - Austin, Dallas, Irving, HoustonVT - Essex JunctionWI - HartlandOpportunities in these locations will vary based on business demand.What You’ll Do:· You’ll work in an Agile, collaborative environment to understand requirements, design, code and test innovative applications, and support those applications for our highly valued customers.· You’ll employ IBM’s Design Thinking and Agile methodologies to create products that provide a great user experience along with high performance, security, quality, and stability.· You’ll work with a variety of relational databases (SQL, Postgres, DB2, MongoDB), operating systems (Linux, Windows, iOS, Android), and modern UI frameworks (Backbone.js, AngularJS, React, Ember.js, Bootstrap, Node.js, and JQuery).Who You Are:· You are highly motivated and have a passion for creating and supporting great products.· You thrive on collaboration, working side by side with people of all backgrounds and disciplines, and you have very strong verbal and written communication skills.· You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.· You have a basic understanding of software development and programming in a language .Net ,Java, Javascript, C, C++, or Python.Required Technical and Professional Expertise· Must have basic knowledge in one of the following technology areas: .Net,Java, Javascript, C, C++, or PythonPreferred Tech and Prof Experience· Willing to travel up to 10%· Bachelors or Masters DegreeJob Types: Full-time, ContractSalary: $50,000.00 to $60,000.00 /yearEducation:Bachelor's (Preferred)"},{"content":"Entry-Level Software Developersare in demand across USA You'll be matched and deployed to a development team in a strategic business, based on your offered location and fit.AZ - Tuscon, PhoenixCA - Almaden, Costa Mesa, Emeryville, Foster City, San Francisco, San JoseCO - DenverGA - Atlanta, Brookhaven, Sandy SpringsIL - ChicagoMA - Cambridge, LittletonMN - RochesterNC - Raleigh-DurhamNY - New York City, North Castle/Armonk, Poughkeepsie, Yorktown Heights, EndicottOH - DublinOR - HillsboroPA - Blue Bell, PittsburghTX - Austin, Dallas, Irving, HoustonVT - Essex JunctionWI - HartlandOpportunities in these locations will vary based on business demand.What You’ll Do:· You’ll work in an Agile, collaborative environment to understand requirements, design, code and test innovative applications, and support those applications for our highly valued customers.· You’ll employ IBM’s Design Thinking and Agile methodologies to create products that provide a great user experience along with high performance, security, quality, and stability.· You’ll work with a variety of relational databases (SQL, Postgres, DB2, MongoDB), operating systems (Linux, Windows, iOS, Android), and modern UI frameworks (Backbone.js, AngularJS, React, Ember.js, Bootstrap, Node.js, and JQuery).Who You Are:· You are highly motivated and have a passion for creating and supporting great products.· You thrive on collaboration, working side by side with people of all backgrounds and disciplines, and you have very strong verbal and written communication skills.· You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.· You have a basic understanding of software development and programming in a language .Net ,Java, Javascript, C, C++, or Python.Required Technical and Professional Expertise· Must have basic knowledge in one of the following technology areas: .Net,Java, Javascript, C, C++, or PythonPreferred Tech and Prof Experience· Willing to travel up to 10%· Bachelors or Masters DegreeJob Types: Full-time, ContractSalary: $50,000.00 to $60,000.00 /yearEducation:Bachelor's (Preferred)"},{"content":"Brookhaven National Laboratory is a multipurpose research institution funded primarily by the U.S. Department of Energy’s Office of Science. Located on the center of Long Island, New York, Brookhaven Lab brings world-class facilities and expertise to the most exciting and important questions in basic and applied science—from the birth of our universe to the sustainable energy technology of tomorrow. We operate cutting-edge large-scale facilities for studies in physics, chemistry, biology, medicine, applied science, and a wide range of advanced technologies. The Laboratory's almost 3,000 scientists, engineers, and support staff are joined each year by more than 4,000 visiting researchers from around the world. Our award-winning history, including seven Nobel Prizes, stretches back to 1947, and we continue to unravel mysteries from the nanoscale to the cosmic scale, and everything in between. Brookhaven is operated and managed by Brookhaven Science Associates, which was founded by the Research Foundation for the State University of New York on behalf of Stony Brook University, and Battelle, a nonprofit applied science and technology organization.\nOrganizational Overview\n\nBrookhaven National Laboratory (BNL) is a scientific, extreme scale Data Laboratory in the US, New York State, Long Island. With over 140 PB of archived data, the Scientific Data & Computing Center (SDCC) at BNL hosts the largest scientific data archive in the US, and the 3rd largest worldwide. The SDCC stores and processes scientific data from local facilities such as the Relativistic Heavy Ion Collider (RHIC), and the National Synchrotron Light Source II (NSLS II), the Center for Functional Nano Materials and the Atmospheric Radiation Measurement program. The SDCC is the largest computing center for the ATLAS experiment at CERN, and the data center outside of Japan for the particle physics experiment Belle II.\n\nAs a result, we have a lively, fast growing data science research program at BNL, with a specific focus on the challenges presented by the analysis, interpretation, and use of data at extreme scales and in real time. The data science program is accompanied by significant computational modeling research effort, in support of the design, planning, analysis, and interpretation of experiments and their results. The Computational Science Initiative (CSI - https://www.bnl.gov/compsci/) provides a laboratory-wide umbrella for these activities, bringing together computer scientists, applied mathematicians, and domain scientists to carry out leading edge research, convert research results into practical solutions that advance domain science, and provide the necessary computing infrastructure services and training to support efficient operation.\n\nCSI is now looking for a software developer to to work in a multi-disciplinary team, delivering exciting software solutions for the System Biology Knowledgebase (https://kbase.us).\n\nPosition Description\n\nEssential Duties and Responsibilities:\nWork on issues of diverse scope; may include working with other KBase members to implement software to meet stakeholder needs; working with users of the analysis software to ensure that their needs are being met as well as to test and debug applications.\nPrepare presentations and papers for internal use, conferences, and peer-reviewed publication.\nMaintain accurate documentation and source-code control for all work-product.\nExecute full lifecycle software development.\nWrite well-designed, testable, efficient code.\nProduce specifications and determine operational feasibility.\nIntegrate software components into a fully functional software system.\nDevelop software verification plans and quality assurance procedures.\nDocument and maintain software functionality.\nTailor and deploy software tools, processes and metrics.\nComply with project plans and industry standards.\nPosition Requirements\n\nRequired Knowledge, Skills and Abilities:\nBachelor’s Degree or equivalent plus 3 years of software development experience or MS degree plus 1 year of software development experience or PhD in Computer Science or related discipline.\nExperience with modern practices of open collaborative software development, including code review, the GitHub pull request model, etc.\nExperience in designing interactive applications\nDemonstrated high analytical skills and programming skills (highest preference for Java or Python but open to C/C++)\nFamiliarity with software engineering practices that include testing, documentation, source code management and release procedures\nDemonstrated ability to work collaboratively with programmers, engineers, postdocs, graduate students, and undergraduates from diverse backgrounds\nExcellent writing, interpersonal communication, and analytical skills\n\nPreferred Knowledge, Skills, and Abilities:\nGraduate degree in bioinformatics, computational biology, microbiology and bio- or chemical engineering discipline or a software related degree program\nFamiliarity with Agile software practices (e.g., Scrum, Kanban)\nExperience in bioinformatics software design and engineering, mathematical analysis and comparative and functional genomics\nExperience with developing applications to display/visualize scientific (preferably biological) data\nExperience with scientific analysis tools such as Matlab, R, or Mathematica\nExperience with Jupyter Notebook, Docker\nThe ability to obtain and maintain a DOE “Q” security clearance\n\nOther Information:\nAt Brookhaven National Laboratory we believe that a comprehensive employee benefits program is an important and meaningful part of the compensation employees receive. Our benefits program includes, but is not limited to:\nMedical Plans\nVacation\nHolidays\nDental Plans\nLife Insurance\n401(k) Plan\nRetirement Plan\nSwimming Pool, Weight Room, Tennis Courts, and many other employee perks and benefits\n\nWe invite you to consider Brookhaven National Laboratory for employment. To be considered for this position, please apply online at BNL Careers and enter the job title into the Keyword Search.\n\nBrookhaven National Laboratory (BNL) is an equal opportunity employer committed to ensuring that all qualified applicants receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, status as a veteran, disability or any other federal, state or local protected class.\n\nBNL takes affirmative action in support of its policy and to advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities.\n\nVEVRAA Federal Contractor\n"},{"content":"Brookhaven National Laboratory is a multipurpose research institution funded primarily by the U.S. Department of Energy’s Office of Science. Located on the center of Long Island, New York, Brookhaven Lab brings world-class facilities and expertise to the most exciting and important questions in basic and applied science—from the birth of our universe to the sustainable energy technology of tomorrow. We operate cutting-edge large-scale facilities for studies in physics, chemistry, biology, medicine, applied science, and a wide range of advanced technologies. The Laboratory's almost 3,000 scientists, engineers, and support staff are joined each year by more than 4,000 visiting researchers from around the world. Our award-winning history, including seven Nobel Prizes, stretches back to 1947, and we continue to unravel mysteries from the nanoscale to the cosmic scale, and everything in between. Brookhaven is operated and managed by Brookhaven Science Associates, which was founded by the Research Foundation for the State University of New York on behalf of Stony Brook University, and Battelle, a nonprofit applied science and technology organization.\nOrganizational Overview\n\nBrookhaven National Laboratory (BNL) is a scientific, extreme scale Data Laboratory in the US, New York State, Long Island. With over 140 PB of archived data, the Scientific Data & Computing Center (SDCC) at BNL hosts the largest scientific data archive in the US, and the 3rd largest worldwide. The SDCC stores and processes scientific data from local facilities such as the Relativistic Heavy Ion Collider (RHIC), and the National Synchrotron Light Source II (NSLS II), the Center for Functional Nano Materials and the Atmospheric Radiation Measurement program. The SDCC is the largest computing center for the ATLAS experiment at CERN, and the data center outside of Japan for the particle physics experiment Belle II.\n\nAs a result, we have a lively, fast growing data science research program at BNL, with a specific focus on the challenges presented by the analysis, interpretation, and use of data at extreme scales and in real time. The data science program is accompanied by significant computational modeling research effort, in support of the design, planning, analysis, and interpretation of experiments and their results. The Computational Science Initiative (CSI - https://www.bnl.gov/compsci/) provides a laboratory-wide umbrella for these activities, bringing together computer scientists, applied mathematicians, and domain scientists to carry out leading edge research, convert research results into practical solutions that advance domain science, and provide the necessary computing infrastructure services and training to support efficient operation.\n\nCSI is now looking for a software developer to to work in a multi-disciplinary team, delivering exciting software solutions for the System Biology Knowledgebase (https://kbase.us).\n\nPosition Description\n\nEssential Duties and Responsibilities:\nWork on issues of diverse scope; may include working with other KBase members to implement software to meet stakeholder needs; working with users of the analysis software to ensure that their needs are being met as well as to test and debug applications.\nPrepare presentations and papers for internal use, conferences, and peer-reviewed publication.\nMaintain accurate documentation and source-code control for all work-product.\nExecute full lifecycle software development.\nWrite well-designed, testable, efficient code.\nProduce specifications and determine operational feasibility.\nIntegrate software components into a fully functional software system.\nDevelop software verification plans and quality assurance procedures.\nDocument and maintain software functionality.\nTailor and deploy software tools, processes and metrics.\nComply with project plans and industry standards.\nPosition Requirements\n\nRequired Knowledge, Skills and Abilities:\nBachelor’s Degree or equivalent plus 3 years of software development experience or MS degree plus 1 year of software development experience or PhD in Computer Science or related discipline.\nExperience with modern practices of open collaborative software development, including code review, the GitHub pull request model, etc.\nExperience in designing interactive applications\nDemonstrated high analytical skills and programming skills (highest preference for Java or Python but open to C/C++)\nFamiliarity with software engineering practices that include testing, documentation, source code management and release procedures\nDemonstrated ability to work collaboratively with programmers, engineers, postdocs, graduate students, and undergraduates from diverse backgrounds\nExcellent writing, interpersonal communication, and analytical skills\n\nPreferred Knowledge, Skills, and Abilities:\nGraduate degree in bioinformatics, computational biology, microbiology and bio- or chemical engineering discipline or a software related degree program\nFamiliarity with Agile software practices (e.g., Scrum, Kanban)\nExperience in bioinformatics software design and engineering, mathematical analysis and comparative and functional genomics\nExperience with developing applications to display/visualize scientific (preferably biological) data\nExperience with scientific analysis tools such as Matlab, R, or Mathematica\nExperience with Jupyter Notebook, Docker\nThe ability to obtain and maintain a DOE “Q” security clearance\n\nOther Information:\nAt Brookhaven National Laboratory we believe that a comprehensive employee benefits program is an important and meaningful part of the compensation employees receive. Our benefits program includes, but is not limited to:\nMedical Plans\nVacation\nHolidays\nDental Plans\nLife Insurance\n401(k) Plan\nRetirement Plan\nSwimming Pool, Weight Room, Tennis Courts, and many other employee perks and benefits\n\nWe invite you to consider Brookhaven National Laboratory for employment. To be considered for this position, please apply online at BNL Careers and enter the job title into the Keyword Search.\n\nBrookhaven National Laboratory (BNL) is an equal opportunity employer committed to ensuring that all qualified applicants receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, status as a veteran, disability or any other federal, state or local protected class.\n\nBNL takes affirmative action in support of its policy and to advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities.\n\nVEVRAA Federal Contractor\n"},{"content":"At Boston Children’s Hospital, success is measured in patients treated, parents comforted and teams taught. It’s in discoveries made, processes perfected, and technology advanced. In major medical breakthroughs and small acts of kindness. And in colleagues who have your back and patients who have your heart. As the teaching hospital of Harvard Medical School, our reach is global and our impact is profound. Join our neuroimaging team in the Fetal-Neonatal Neuroimaging (https://www.fnndsc.org) and Developmental Science Center and bring cutting edge computational technology into clinical and research efforts.\n\nThe Research Programmer will be responsible for:\nCollaborating with Project Director and Principal Investigator on the design, functionality, development, implementation, and validation of a centralized databases housing de-identified imaging data that is web-accessible and searchable\nBeing an active developer on the ChRIS project that spans, BCH, Boston University, North Eastern University, the Massachusetts Open Cloud, and RedHat (see https://www.redhat.com/chris) for overview / background\nSpecifically we are looking for Javascript developer with React skillset who can develop compelling UI/UIX for the ChRIS system\n\nSupporting the neuroinformatics team at the FNNDSC:\nLinux system support and admin\nHigh Performance Compute\nCloud-based technologies, including openstack, openshift, and and open storage such as swift\nDesigning, developing, testing, validating, and managing computational systems\nWriting/implementing data management plans, data entry guidelines, and data completion guidelines in compliance with SOP's, ICH-GCP guidelines, and FDA requirements.\nSupporting clinical research reporting for data review, quality control edit checks, interim and final analysis.\nCompleting database cleaning and database lock, and assists research biostatisticians with analysis file creation and statistical analyses.\nProviding educational support and training to investigators and study site coordinators for the development and implementation of research studies.\nServing as credible expert/leader for data management best practices.\nEstablishing priorities and strategies for resource development and core goal setting.\nProviding positive and effective customer service and contributions to teamwork.\n\nTo qualify, you must have:\nMaster’s degree (preferred) in computer science, electrical/electronic engineering, physics, or closely related field, coursework in biostatistics or computerized analytic techniques.\n3-5 years of experience as a javascript developer with strong Linux familiarity.\nBash shell scripting important\nPython familiarity important\nGithub and repo creation/forking/collaboration strongly recommended\n1 or more years of supervisory/leadership experience.\nAnalytical skills. Knowledge of and high proficiency in EDC and industry standards (CDISC). Proficiency in other data management and statistical software (e.g. SAS, SQL, web based EDC) is desirable.\n\nBoston Children’s Hospital offers competitive compensation and unmatched benefits, including a rotating days/evenings and week-end schedule, affordable health, vision and dental insurance, generous levels of time off, 403(b) Retirement Savings plan, Pension, Tuition Reimbursement, cell phone plan discounts and discounted rates on T-passes (50% off). Discover your best.\n\nBoston Children’s Hospital is an Equal Opportunity / Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, sexual orientation, gender identity, protected veteran status or disability.\n\nLI\n"}]